nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
/*
 *
 * Copyright (c) 2026 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @addtogroup nrf71_wifi_fw_if Wi-Fi driver and firmware interface
 * @{
 * @brief Control interface between host and RPU
 */

#ifndef __NRF71_WIFI_CTRL_H
#define __NRF71_WIFI_CTRL_H

#include <common/fw_if/nrf71_wifi_rf.h>
#include <common/fw_if/nrf71_wifi_common.h>

#define RPU_DATA_CMD_SIZE_MAX_TX 148
/**
 * @brief The host can send the following commands to the RPU.
 *
 */
enum nrf_wifi_umac_commands {
	/** Trigger a new scan nrf_wifi_umac_cmd_scan */
	NRF_WIFI_UMAC_CMD_TRIGGER_SCAN,
	/** Request for scan results nrf_wifi_umac_cmd_get_scan_results */
	NRF_WIFI_UMAC_CMD_GET_SCAN_RESULTS,
	/** Send authentication request to AP nrf_wifi_umac_cmd_auth */
	NRF_WIFI_UMAC_CMD_AUTHENTICATE,
	/** Send associate request to AP nrf_wifi_umac_cmd_assoc */
	NRF_WIFI_UMAC_CMD_ASSOCIATE,
	/** Send deauthentication request to AP nrf_wifi_umac_cmd_disconn */
	NRF_WIFI_UMAC_CMD_DEAUTHENTICATE,
	/** Set wiphy parameters nrf_wifi_umac_cmd_set_wiphy */
	NRF_WIFI_UMAC_CMD_SET_WIPHY,
	/** Add new key nrf_wifi_umac_cmd_key */
	NRF_WIFI_UMAC_CMD_NEW_KEY,
	/** Delete key nrf_wifi_umac_cmd_key */
	NRF_WIFI_UMAC_CMD_DEL_KEY,
	/** Set default key to use nrf_wifi_umac_cmd_set_key */
	NRF_WIFI_UMAC_CMD_SET_KEY,
	/** Unused */
	NRF_WIFI_UMAC_CMD_GET_KEY,
	/** Unused */
	NRF_WIFI_UMAC_CMD_NEW_BEACON,
	/** Change the beacon on an AP interface nrf_wifi_umac_cmd_set_beacon */
	NRF_WIFI_UMAC_CMD_SET_BEACON,
	/** Set the BSS nrf_wifi_umac_cmd_set_bss */
	NRF_WIFI_UMAC_CMD_SET_BSS,
	/** Start soft AP operation on an AP interface nrf_wifi_umac_cmd_start_ap */
	NRF_WIFI_UMAC_CMD_START_AP,
	/** Stop soft AP operation nrf_wifi_umac_cmd_stop_ap */
	NRF_WIFI_UMAC_CMD_STOP_AP,
	/** Create new interface nrf_wifi_umac_cmd_add_vif */
	NRF_WIFI_UMAC_CMD_NEW_INTERFACE,
	/** Change interface configuration nrf_wifi_umac_cmd_chg_vif_attr*/
	NRF_WIFI_UMAC_CMD_SET_INTERFACE,
	/** Delete interface nrf_wifi_umac_cmd_del_vif */
	NRF_WIFI_UMAC_CMD_DEL_INTERFACE,
	/** Change interface flags nrf_wifi_umac_cmd_chg_vif_state */
	NRF_WIFI_UMAC_CMD_SET_IFFLAGS,
	/** Add a new station nrf_wifi_umac_cmd_add_sta */
	NRF_WIFI_UMAC_CMD_NEW_STATION,
	/** Delete station nrf_wifi_umac_cmd_del_sta */
	NRF_WIFI_UMAC_CMD_DEL_STATION,
	/** Change station info nrf_wifi_umac_cmd_chg_sta */
	NRF_WIFI_UMAC_CMD_SET_STATION,
	/** Get station info nrf_wifi_umac_cmd_get_sta */
	NRF_WIFI_UMAC_CMD_GET_STATION,
	/** Start the P2P device nrf_wifi_cmd_start_p2p */
	NRF_WIFI_UMAC_CMD_START_P2P_DEVICE,
	/** Stop the P2P device nrf_wifi_umac_cmd_stop_p2p_dev */
	NRF_WIFI_UMAC_CMD_STOP_P2P_DEVICE,
	/** Remain awake on the specified channel nrf_wifi_umac_cmd_remain_on_channel */
	NRF_WIFI_UMAC_CMD_REMAIN_ON_CHANNEL,
	/** Cancel a pending ROC duration nrf_wifi_umac_cmd_cancel_remain_on_channel */
	NRF_WIFI_UMAC_CMD_CANCEL_REMAIN_ON_CHANNEL,
	/** Unused */
	NRF_WIFI_UMAC_CMD_SET_CHANNEL,
	/** Unused */
	NRF_WIFI_UMAC_CMD_RADAR_DETECT,
	/** Whitelist filter based on frame types nrf_wifi_umac_cmd_mgmt_frame_reg */
	NRF_WIFI_UMAC_CMD_REGISTER_FRAME,
	/** Send a management frame nrf_wifi_umac_cmd_mgmt_tx */
	NRF_WIFI_UMAC_CMD_FRAME,
	/** Unused */
	NRF_WIFI_UMAC_CMD_JOIN_IBSS,
	/** Unused */
	NRF_WIFI_UMAC_CMD_WIN_STA_CONNECT,
	/** Power save Enable/Disable nrf_wifi_umac_cmd_set_power_save */
	NRF_WIFI_UMAC_CMD_SET_POWER_SAVE,
	/** Unused */
	NRF_WIFI_UMAC_CMD_SET_WOWLAN,
	/** Unused */
	NRF_WIFI_UMAC_CMD_SUSPEND,
	/** Unused */
	NRF_WIFI_UMAC_CMD_RESUME,
	/** QOS map nrf_wifi_umac_cmd_set_qos_map */
	NRF_WIFI_UMAC_CMD_SET_QOS_MAP,
	/** Get Channel info nrf_wifi_umac_cmd_get_channel */
	NRF_WIFI_UMAC_CMD_GET_CHANNEL,
	/** Get Tx power level nrf_wifi_umac_cmd_get_tx_power */
	NRF_WIFI_UMAC_CMD_GET_TX_POWER,
	/** Get interface nrf_wifi_cmd_get_interface */
	NRF_WIFI_UMAC_CMD_GET_INTERFACE,
	/** Get Wiphy info nrf_wifi_cmd_get_wiphy */
	NRF_WIFI_UMAC_CMD_GET_WIPHY,
	/** Get hardware address nrf_wifi_cmd_get_ifhwaddr */
	NRF_WIFI_UMAC_CMD_GET_IFHWADDR,
	/** Set hardware address nrf_wifi_cmd_set_ifhwaddr */
	NRF_WIFI_UMAC_CMD_SET_IFHWADDR,
	/** Get regulatory domain nrf_wifi_umac_cmd_get_reg */
	NRF_WIFI_UMAC_CMD_GET_REG,
	/** Unused */
	NRF_WIFI_UMAC_CMD_SET_REG,
	/** Set regulatory domain  nrf_wifi_cmd_req_set_reg */
	NRF_WIFI_UMAC_CMD_REQ_SET_REG,
	/** Config UAPSD nrf_wifi_umac_cmd_config_uapsd */
	NRF_WIFI_UMAC_CMD_CONFIG_UAPSD,
	/** Config TWT nrf_wifi_umac_cmd_config_twt */
	NRF_WIFI_UMAC_CMD_CONFIG_TWT,
	/** Teardown TWT nrf_wifi_umac_cmd_teardown_twt */
	NRF_WIFI_UMAC_CMD_TEARDOWN_TWT,
	/** Abort scan nrf_wifi_umac_cmd_abort_scan */
	NRF_WIFI_UMAC_CMD_ABORT_SCAN,
	/** Multicast filter nrf_wifi_umac_cmd_mcast_filter */
	NRF_WIFI_UMAC_CMD_MCAST_FILTER,
	/** Change macaddress nrf_wifi_umac_cmd_change_macaddr */
	NRF_WIFI_UMAC_CMD_CHANGE_MACADDR,
	/** Set powersave timeout nrf_wifi_umac_cmd_set_power_save_timeout */
	NRF_WIFI_UMAC_CMD_SET_POWER_SAVE_TIMEOUT,
	/** Get connection information nrf_wifi_umac_cmd_conn_info */
	NRF_WIFI_UMAC_CMD_GET_CONNECTION_INFO,
	/** Get power save information nrf_wifi_umac_cmd_get_power_save_info */
	NRF_WIFI_UMAC_CMD_GET_POWER_SAVE_INFO,
	/** Set listen interval nrf_wifi_umac_cmd_set_listen_interval */
	NRF_WIFI_UMAC_CMD_SET_LISTEN_INTERVAL,
	/** Configure extended power save nrf_wifi_umac_cmd_config_extended_ps */
	NRF_WIFI_UMAC_CMD_CONFIG_EXTENDED_PS,
	/** Configure quiet period nrf_wifi_umac_cmd_config_quiet_period */
	NRF_WIFI_UMAC_CMD_CONFIG_QUIET_PERIOD,
	/** Command to specify power save exit strategy */
	NRF_WIFI_UMAC_CMD_PS_EXIT_STRATEGY,
	/** Command to program Rx buffers to RPU */
	NRF_WIFI_UMAC_CMD_CONFIG_RX_BUF,
	/** Command to start FTM measurements @ref nrf_wifi_umac_cmd_meas_start */
	NRF_WIFI_UMAC_CMD_MEAS_START,
	/** Command to send GAS QUERY @ref nrf_wifi_cmd_gas_anqp_config */
	NRF_WIFI_UMAC_CMD_GAS_ANQP_QUERY,
	/** Command to send NEIGHBOR request @ref nrf_wifi_cmd_neighbor_req_config */
	NRF_WIFI_UMAC_CMD_CONFIG_NEIGHBOR_REQ,
	/** Command to set sqi threshold */
	NRF_WIFI_UMAC_CMD_SQI_SET_THRESHOLD,
	/** Command to enable/disable ftm responder */
	NRF_WIFI_UMAC_CMD_FTM_RESPONDER_CONFIG,
	/** Command to abort meas */
	NRF_WIFI_UMAC_CMD_MEAS_ABORT
};

/**
 * @brief The host can receive the following events from the RPU.
 *
 */

enum nrf_wifi_umac_events {
	NRF_WIFI_UMAC_EVENT_UNSPECIFIED = 256,
	/** Indicate scan started nrf_wifi_umac_event_trigger_scan */
	NRF_WIFI_UMAC_EVENT_TRIGGER_SCAN_START,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_SCAN_ABORTED,
	/** Indicate scan done nrf_wifi_umac_event_scan_done */
	NRF_WIFI_UMAC_EVENT_SCAN_DONE,
	/** Scan result event nrf_wifi_umac_event_new_scan_results */
	NRF_WIFI_UMAC_EVENT_SCAN_RESULT,
	/** Authentication status nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_AUTHENTICATE,
	/** Association status nrf_wifi_umac_event_mlme*/
	NRF_WIFI_UMAC_EVENT_ASSOCIATE,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_CONNECT,
	/** Station deauth event nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_DEAUTHENTICATE,
	/** Station disassoc event nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_DISASSOCIATE,
	/** Station added indication nrf_wifi_umac_event_new_station */
	NRF_WIFI_UMAC_EVENT_NEW_STATION,
	/** Station added indication nrf_wifi_umac_event_new_station */
	NRF_WIFI_UMAC_EVENT_DEL_STATION,
	/** Station info indication nrf_wifi_umac_event_new_station */
	NRF_WIFI_UMAC_EVENT_GET_STATION,
	/** remain on channel event nrf_wifi_event_remain_on_channel */
	NRF_WIFI_UMAC_EVENT_REMAIN_ON_CHANNEL,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_CANCEL_REMAIN_ON_CHANNEL,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_DISCONNECT,
	/** RX management frame nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_FRAME,
	/** Cookie mapping for NRF_WIFI_UMAC_CMD_FRAME nrf_wifi_umac_event_cookie_rsp */
	NRF_WIFI_UMAC_EVENT_COOKIE_RESP,
	/** TX management frame transmitted nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_FRAME_TX_STATUS,
	/** nrf_wifi_umac_event_vif_state */
	NRF_WIFI_UMAC_EVENT_IFFLAGS_STATUS,
	/** Send Tx power nrf_wifi_umac_event_get_tx_power */
	NRF_WIFI_UMAC_EVENT_GET_TX_POWER,
	/** Send Channel info nrf_wifi_umac_event_get_channel */
	NRF_WIFI_UMAC_EVENT_GET_CHANNEL,
	/** nrf_wifi_umac_event_set_interface */
	NRF_WIFI_UMAC_EVENT_SET_INTERFACE,
	/** nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_UNPROT_DEAUTHENTICATE,
	/** nrf_wifi_umac_event_mlme */
	NRF_WIFI_UMAC_EVENT_UNPROT_DISASSOCIATE,
	/** nrf_wifi_interface_info */
	NRF_WIFI_UMAC_EVENT_NEW_INTERFACE,
	/** nrf_wifi_event_get_wiphy */
	NRF_WIFI_UMAC_EVENT_NEW_WIPHY,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_GET_IFHWADDR,
	/** Get regulatory nrf_wifi_reg */
	NRF_WIFI_UMAC_EVENT_GET_REG,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_SET_REG,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_REQ_SET_REG,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_GET_KEY,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_BEACON_HINT,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_REG_CHANGE,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_WIPHY_REG_CHANGE,
	/** Display scan result nrf_wifi_umac_event_new_scan_display_results */
	NRF_WIFI_UMAC_EVENT_SCAN_DISPLAY_RESULT,
	/** nrf_wifi_umac_event_cmd_status */
	NRF_WIFI_UMAC_EVENT_CMD_STATUS,
	/** nrf_wifi_umac_event_new_scan_results */
	NRF_WIFI_UMAC_EVENT_BSS_INFO,
	/** Send TWT response information nrf_wifi_umac_cmd_config_twt */
	NRF_WIFI_UMAC_EVENT_CONFIG_TWT,
	/** Send TWT teardown information nrf_wifi_umac_cmd_teardown_twt */
	NRF_WIFI_UMAC_EVENT_TEARDOWN_TWT,
	/** Send block or unblock state nrf_wifi_umac_event_twt_sleep */
	NRF_WIFI_UMAC_EVENT_TWT_SLEEP,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_COALESCING,
	/** Unused */
	NRF_WIFI_UMAC_EVENT_MCAST_FILTER,
	/** send connection information nrf_wifi_umac_event_conn_info. */
	NRF_WIFI_UMAC_EVENT_GET_CONNECTION_INFO,
	/** nrf_wifi_umac_event_power_save_info */
	NRF_WIFI_UMAC_EVENT_GET_POWER_SAVE_INFO,
	/** Send measurement results nrf_wifi_umac_meas_result_info */
	NRF_WIFI_UMAC_EVENT_PEER_MEAS_RESULTS,
	/** Send gas results nrf_wifi_umac_event_get_gas_anqp_resp */
	NRF_WIFI_UMAC_EVENT_GAS_QUERY_RESP_INFO,
	/** Send neighbor results nrf_wifi_event_neighbor_report_result */
	NRF_WIFI_UMAC_EVENT_NEIGHBOR_RESP_INFO,
	/** Event to send sqi threshold */
	NRF_WIFI_UMAC_EVENT_SQI_SET_THRESHOLD,
	/** Eevnt to send ADD KEY command status */
	NRF_WIFI_UMAC_EVENT_NEW_KEY_STATUS
};

/**
 * @brief Represents the values that can be used to specify the frequency band.
 *
 */

enum nrf_wifi_band {
	/** 2.4 GHz ISM band */
	NRF_WIFI_BAND_2GHZ,
	/** Around 5 GHz band (4.9 - 5.7 GHz) */
	NRF_WIFI_BAND_5GHZ,
	/** 6 GHz band (5.9 -6.4 GHz) */
	NRF_WIFI_BAND_6GHZ,
	/** Unused */
	NRF_WIFI_BAND_60GHZ,
	/** Invalid */
	NRF_WIFI_BAND_INVALID
};

/**
 * @brief Enable or Disable Management Frame Protection.
 *
 */
enum nrf_wifi_mfp {
	/** Management frame protection not used */
	NRF_WIFI_MFP_NO,
	/** Management frame protection required */
	NRF_WIFI_MFP_REQUIRED,
};

/**
 * @brief Enumerates the various categories of security keys.
 *
 */
enum nrf_wifi_key_type {
	/** Group (broadcast/multicast) key */
	NRF_WIFI_KEYTYPE_GROUP,
	/** Pairwise (unicast/individual) key */
	NRF_WIFI_KEYTYPE_PAIRWISE,
	/** Peer key (DLS) */
	NRF_WIFI_KEYTYPE_PEERKEY,
	/** Number of defined key types */
	NUM_NRF_WIFI_KEYTYPES
};

/**
 * @brief Enumerates the various types of authentication mechanisms.
 *
 */
enum nrf_wifi_auth_type {
	/** Open System authentication */
	NRF_WIFI_AUTHTYPE_OPEN_SYSTEM,
	/** Shared Key authentication (WEP only) */
	NRF_WIFI_AUTHTYPE_SHARED_KEY,
	/** Fast BSS Transition (IEEE 802.11r) */
	NRF_WIFI_AUTHTYPE_FT,
	/** Network EAP (some Cisco APs and mainly LEAP) */
	NRF_WIFI_AUTHTYPE_NETWORK_EAP,
	/** Simultaneous authentication of equals */
	NRF_WIFI_AUTHTYPE_SAE,
	/** Internal */
	__NRF_WIFI_AUTHTYPE_NUM,
	/** Maximum valid auth algorithm */
	NRF_WIFI_AUTHTYPE_MAX = __NRF_WIFI_AUTHTYPE_NUM,
	/** Determine automatically (if necessary by trying multiple times) */
	NRF_WIFI_AUTHTYPE_AUTOMATIC
};

/**
 * @brief Represents the interface's status concerning this BSS (Basic Service Set).
 *
 */
enum nrf_wifi_bss_status {
	/**
	 * Authenticated with this BSS
	 * Note that this is no longer used since cfg80211 no longer
	 * keeps track of whether or not authentication was done with
	 * a given BSS.
	 */
	NRF_WIFI_BSS_STATUS_AUTHENTICATED,
	/** Associated with this BSS */
	NRF_WIFI_BSS_STATUS_ASSOCIATED,
	/** Joined to this IBSS */
	NRF_WIFI_BSS_STATUS_IBSS_JOINED,
};

/**
 * @brief Enumerates the various categories of channels.
 *
 */
enum nrf_wifi_channel_type {
	/** 20 MHz, non-HT channel */
	NRF_WIFI_CHAN_NO_HT,
	/** 20 MHz HT channel */
	NRF_WIFI_CHAN_HT20,
	/** HT40 channel, secondary channel below the control channel */
	NRF_WIFI_CHAN_HT40MINUS,
	/** HT40 channel, secondary channel above the control channel */
	NRF_WIFI_CHAN_HT40PLUS
};

/**
 * @brief Enumerates the various channel widths available.
 *
 */
enum nrf_wifi_chan_width {
	/** 20 MHz, non-HT channel */
	NRF_WIFI_CHAN_WIDTH_20_NOHT,
	/** 20 MHz HT channel */
	NRF_WIFI_CHAN_WIDTH_20,
	/** 40 MHz channel, the NRF_WIFI_ATTR_CENTER_FREQ1 must be provided as well */
	NRF_WIFI_CHAN_WIDTH_40,
	/** 80 MHz channel, the NRF_WIFI_ATTR_CENTER_FREQ1 must be provided as well */
	NRF_WIFI_CHAN_WIDTH_80,
	/** 80+80 MHz channel, the NRF_WIFI_ATTR_CENTER_FREQ1 and
	 *  NRF_WIFI_ATTR_CENTER_FREQ2 must be provided as well
	 */
	NRF_WIFI_CHAN_WIDTH_80P80,
	/** 160 MHz channel, the NRF_WIFI_ATTR_CENTER_FREQ1 must be provided as well */
	NRF_WIFI_CHAN_WIDTH_160,
	/**  5 MHz OFDM channel */
	NRF_WIFI_CHAN_WIDTH_5,
	/** 10 MHz OFDM channel */
	NRF_WIFI_CHAN_WIDTH_10,
};

/**
 * @brief Interface types based on functionality.
 *
 */
enum nrf_wifi_iftype {
	/** Unspecified type, driver decides */
	NRF_WIFI_IFTYPE_UNSPECIFIED,
	/** Not Supported */
	NRF_WIFI_IFTYPE_ADHOC,
	/** Managed BSS member */
	NRF_WIFI_IFTYPE_STATION,
	/** Access point */
	NRF_WIFI_IFTYPE_AP,
	/** Not Supported */
	NRF_WIFI_IFTYPE_AP_VLAN,
	/** Not Supported */
	NRF_WIFI_IFTYPE_WDS,
	/** Not Supported */
	NRF_WIFI_IFTYPE_MONITOR,
	/** Not Supported */
	NRF_WIFI_IFTYPE_MESH_POINT,
	/** P2P client */
	NRF_WIFI_IFTYPE_P2P_CLIENT,
	/** P2P group owner */
	NRF_WIFI_IFTYPE_P2P_GO,
	/** P2P device use the NRF_WIFI_UMAC_CMD_START_P2P_DEVICE &
	 *  NRF_WIFI_UMAC_CMD_STOP_P2P_DEVICE commands to create and destroy one
	 */
	NRF_WIFI_IFTYPE_P2P_DEVICE,
	/** Not Supported */
	NRF_WIFI_IFTYPE_OCB,
	/** Tx Packet injector mode. */
	NRF_WIFI_TX_INJECTOR,
	/** Station + Tx Packet injector mode. */
	NRF_WIFI_STA_TX_INJECTOR,
	/** Monitor + Tx Packet injector mode. */
	NRF_WIFI_MONITOR_TX_INJECTOR,
	/** Station + Promiscuous mode. */
	NRF_WIFI_STA_PROMISC,
	/** Station + Promiscuous mode + TX Packet injector. */
	NRF_WIFI_STA_PROMISC_TX_INJECTOR,
	/** Highest interface type number currently defined */
	NUM_NRF_WIFI_IFTYPES,
	/** Number of defined interface types */
	NRF_WIFI_IFTYPE_MAX = NUM_NRF_WIFI_IFTYPES - 1
};

/**
 * @brief Powersave state.
 *
 */
enum nrf_wifi_ps_state {
	/** powersave is disabled */
	NRF_WIFI_PS_DISABLED,
	/** powersave is enabled */
	NRF_WIFI_PS_ENABLED,
};

/**
 * @brief WLAN security types.
 *
 */
enum nrf_wifi_security_type {
	/** OPEN */
	NRF_WIFI_OPEN,
	/** WEP */
	NRF_WIFI_WEP,
	/** WPA */
	NRF_WIFI_WPA,
	/** WPA2 */
	NRF_WIFI_WPA2,
	/** WAPI */
	NRF_WIFI_WAPI,
	/** Enterprise mode */
	NRF_WIFI_EAP,
	/** FT 8021X */
	NRF_WIFI_FT_EAP,
	/** Enterprise tls SHA256 */
	NRF_WIFI_EAP_TLS_SHA256,
	/** WPA2 SHA256 */
	NRF_WIFI_WPA2_256,
	/** WPA3-HNP */
	NRF_WIFI_WPA3_HNP,
	/** WPA3-H2E */
	NRF_WIFI_WPA3_H2E,
	/** WPA3-AUTO : HNP-H2E */
	NRF_WIFI_WPA3_AUTO,
	/** WPA3-FT-SAE */
	NRF_WIFI_WPA3_FT_SAE,
	/** 8021X SUITE-B SHA256 */
	NRF_WIFI_EAP_SUITEB_SHA256,
	/** 8021X SUITE-B SHA384 */
	NRF_WIFI_EAP_SUITEB_SHA384,
	/** FT 8021X SHA384 */
	NRF_WIFI_FT_EAP_SHA384,
	/** FT PSK SHA384 */
	NRF_WIFI_FT_PSK_SHA384,
	/** PSK SHA384 */
	NRF_WIFI_PSK_SHA384,
	/** Enhanced Open: Opportunistic wirelesss encryption */
	NRF_WIFI_OWE,
};

/**
 * @brief Denotes the originator of a regulatory domain request.
 *
 */
enum nrf_wifi_reg_initiator {
	/** Core queried CRDA for a dynamic world regulatory domain */
	NRF_WIFI_REGDOM_SET_BY_CORE,
	/** User asked the wireless core to set the regulatory domain */
	NRF_WIFI_REGDOM_SET_BY_USER,
	/**
	 * A wireless drivers has hinted to the wireless core it thinks
	 * its knows the regulatory domain we should be in
	 */
	NRF_WIFI_REGDOM_SET_BY_DRIVER,
	/**
	 * the wireless core has received an
	 * 802.11 country information element with regulatory information it
	 * thinks we should consider. cfg80211 only processes the country
	 * code from the IE, and relies on the regulatory domain information
	 * structure passed by userspace (CRDA) from our wireless-regdb
	 * If a channel is enabled but the country code indicates it should
	 * be disabled we disable the channel and re-enable it upon disassociation
	 */
	NRF_WIFI_REGDOM_SET_BY_COUNTRY_IE,
};

/**
 * @brief Specifies the type of regulatory domain.
 *
 */
enum nrf_wifi_reg_type {
	/**
	 * the regulatory domain set is one that pertains
	 * to a specific country. When this is set you can count on the
	 * ISO / IEC 3166 alpha2 country code being valid.
	 *
	 */
	NRF_WIFI_REGDOM_TYPE_COUNTRY,
	/** the regulatory set domain is the world regulatory domain */
	NRF_WIFI_REGDOM_TYPE_WORLD,
	/**
	 * the regulatory domain set is a custom
	 * driver specific world regulatory domain. These do not apply system-wide
	 * and are only applicable to the individual devices which have requested
	 * them to be applied.
	 */
	NRF_WIFI_REGDOM_TYPE_CUSTOM_WORLD,
	/**
	 * the regulatory domain set is the product
	 * of an intersection between two regulatory domains -- the previously
	 * set regulatory domain on the system and the last accepted regulatory
	 * domain request to be processed.
	 */
	NRF_WIFI_REGDOM_TYPE_INTERSECTION,
};

#define NRF_WIFI_MAX_SSID_LEN 32

/**
 * @brief This structure provides details about the SSID.
 *
 */

struct nrf_wifi_ssid {
	/** length of SSID */
	unsigned char nrf_wifi_ssid_len;
	/** SSID string */
	unsigned char nrf_wifi_ssid[NRF_WIFI_MAX_SSID_LEN];
} __NRF_WIFI_PKD;

