nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_MAX_IE_LEN 600

/**
 * @brief This structure contains data related to the Information Elements (IEs).
 *
 */

struct nrf_wifi_ie {
	/** length of IE */
	unsigned short ie_len;
	/** Information element data */
	signed char ie[NRF_WIFI_MAX_IE_LEN];
} __NRF_WIFI_PKD;

#define NRF_WIFI_MAX_SEQ_LENGTH 256

/**
 * @brief Transmit key sequence number.
 *
 */

struct nrf_wifi_seq {
	/** Length of the seq parameter */
	signed int nrf_wifi_seq_len;
	/** Key sequence number data */
	unsigned char nrf_wifi_seq[NRF_WIFI_MAX_SEQ_LENGTH];
} __NRF_WIFI_PKD;

#define NRF_WIFI_MAX_KEY_LENGTH 256

/**
 * @brief This structure holds information related to a security key.
 *
 */

struct nrf_wifi_key {
	/** Length of the key data */
	unsigned int nrf_wifi_key_len;
	/** Key data */
	unsigned char nrf_wifi_key[NRF_WIFI_MAX_KEY_LENGTH];
} __NRF_WIFI_PKD;

#define NRF_WIFI_MAX_SAE_DATA_LENGTH 256

/**
 * @brief This structure represents SAE elements in Authentication frame.
 *
 */

struct nrf_wifi_sae {
	/** Length of SAE element data */
	signed int sae_data_len;
	/** SAE element data */
	unsigned char sae_data[NRF_WIFI_MAX_SAE_DATA_LENGTH];
} __NRF_WIFI_PKD;

#define NRF_WIFI_MAX_FRAME_LEN 600

/**
 * @brief This structure defines the frame that is intended for transmission.
 *
 */

struct nrf_wifi_frame {
	/** Length of the frame  */
	signed int frame_len;
	/** frame data */
	signed char frame[NRF_WIFI_MAX_FRAME_LEN];
} __NRF_WIFI_PKD;

#define NRF_WIFI_INDEX_IDS_WDEV_ID_VALID (1 << 0)
#define NRF_WIFI_INDEX_IDS_IFINDEX_VALID (1 << 1)
#define NRF_WIFI_INDEX_IDS_WIPHY_IDX_VALID (1 << 2)

/**
 * @brief This structure contains details about the interface information.
 *
 */

struct nrf_wifi_index_ids {
	/** Indicate which properties below are set */
	unsigned int valid_fields;
	/** wdev id */
	signed int ifaceindex;
	/** Unused */
	signed int nrf_wifi_wiphy_idx;
	/** Unused */
	unsigned long long wdev_id;
} __NRF_WIFI_PKD;

#define NRF_WIFI_SUPP_RATES_BAND_VALID (1 << 0)
#define NRF_WIFI_MAX_SUPP_RATES 60

/**
 * @brief This structure provides information about the rate parameters.
 *
 */

struct nrf_wifi_supp_rates {
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Frequency band, see &enum nrf_wifi_band */
	signed int band;
	/** Number of values in rates parameter */
	signed int nrf_wifi_num_rates;
	/** List of supported rates as defined by IEEE 802.11 7.3.2.2 */
	unsigned char rates[NRF_WIFI_MAX_SUPP_RATES];
} __NRF_WIFI_PKD;

/**
 * @brief This structure contains details about a channel's information.
 *
 */
struct nrf_wifi_channel {
	/** band this channel belongs to */
	signed int band;
	/** center frequency in MHz */
	unsigned int center_frequency;
	/** channel flags from see &enum nrf_wifi_channel_flags */
	unsigned int nrf_wifi_flags;
	/** maximum antenna gain in dBi */
	signed int nrf_wifi_max_antenna_gain;
	/** maximum transmission power (in dBm) */
	signed int nrf_wifi_max_power;
	/** maximum regulatory transmission power (in dBm) */
	signed int nrf_wifi_max_reg_power;
	/** channel flags at registration time, used by regulatory
	 *  code to support devices with additional restrictions
	 */
	unsigned int nrf_wifi_orig_flags;
	/** internal use */
	signed int nrf_wifi_orig_mag;
	/** internal use */
	signed int nrf_wifi_orig_mpwr;
	/** hardware-specific value for the channel */
	unsigned short hw_value;
	/** helper to regulatory code to indicate when a beacon
	 *  has been found on this channel. Use regulatory_hint_found_beacon()
	 *  to enable this, this is useful only on 5 GHz band.
	 */
	signed char nrf_wifi_beacon_found;
} __NRF_WIFI_PKD;

#define NRF_WIFI_SCAN_MAX_NUM_SSIDS 2
/** 25 more channels in 6 GHz up to U-NII-5*/
#define NRF_WIFI_SCAN_MAX_NUM_FREQUENCIES 89
#define MAX_NUM_CHANNELS 42


/**
 * @brief This structure provides details about the parameters required for a scan request.
 *
 */
struct nrf_wifi_scan_params {
	/** If 0x1, RPU force passive scan on all channels */
	unsigned short passive_scan;
	/** Number of ssid's in scan_ssids parameter */
	unsigned char num_scan_ssids;
	/** Specific SSID's to scan for */
	struct nrf_wifi_ssid scan_ssids[NRF_WIFI_SCAN_MAX_NUM_SSIDS];
	/** used to send probe requests at non CCK rate in 2GHz band */
	unsigned char no_cck;
	/** Bitmap of bands to be scanned (NRF_WIFI_OP_BAND_2GHZ, NRF_WIFI_OP_BAND_5GHZ,
	 *  NRF_WIFI_OP_BAND_6GHZ)
	 */
	unsigned char bands;
	/** Information element(s) data nrf_wifi_ie*/
	struct nrf_wifi_ie ie;
	/** MAC address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Max scan duration in active scan. If zero rpu programs 50msec */
	unsigned short dwell_time_active;
	/** Max scan duration in passive scan. If zero rpu programs 150msec */
	unsigned short dwell_time_passive;
	/** Number of channels to be scanned */
	unsigned short num_scan_channels;
	/** If true, skip local and IANA Unicast reserved MACs **/
	unsigned char skip_local_admin_macs;
	/**
	 * Maximum time (in milliseconds) the module can operate without a BT grant
	 * before requiring Bluetooth access.
	 * Minimum allowed value: 30 ms.
	 * Use 0 or 0xFFFFFFFF for infinite duration (Wi-Fi can use the medium for
	 * the entire scan without allocating grant to BT).
	 * This parameter applies only to scan operations in the 2.4 GHz band
	 */
	unsigned int bt_grant_tolerance_time;
	/**
	 * Variable encodes the amount of time (in milliseconds) BT expects between
	 * scan operations. BT coexistence logic will attempt to allocate this
	 * amount of time while scanning between channels.
	 */
	unsigned int bt_grant_time;
	/** specific channels to be scanned */
	unsigned int center_frequency[0];
} __NRF_WIFI_PKD;

#define NRF_WIFI_HT_CAPABILITY_VALID (1 << 0)
#define NRF_WIFI_HT_CAPABILITY_MASK_VALID (1 << 1)
#define NRF_WIFI_VHT_CAPABILITY_VALID (1 << 2)
#define NRF_WIFI_VHT_CAPABILITY_MASK_VALID (1 << 3)

#define NRF_WIFI_CMD_HT_VHT_CAPABILITY_DISABLE_HT (1 << 0)

#define NRF_WIFI_SIGNAL_TYPE_NONE 1
#define NRF_WIFI_SIGNAL_TYPE_MBM 2
#define NRF_WIFI_SIGNAL_TYPE_UNSPEC 3

/**
 * @brief This structure represents information related to the signal strength.
 *
 */

struct nrf_wifi_signal {
	/** MBM or unspecified */
	unsigned int signal_type;

	/** signal */
	union {
		/** If MBM signal strength of probe response/beacon
		 *  in mBm (100 * dBm) (s32)
		 */
		unsigned int mbm_signal;
		/** If unspecified signal strength of the probe response/beacon
		 *  in unspecified units, scaled to 0..100 (u8).
		 */
		unsigned char unspec_signal;
	} __NRF_WIFI_PKD signal;
} __NRF_WIFI_PKD;

#define NRF_WIFI_WPA_VERSION_1 (1 << 0)
#define NRF_WIFI_WPA_VERSION_2 (1 << 1)

#define NRF_WIFI_CONNECT_COMMON_INFO_MAC_ADDR_VALID (1 << 0)
#define NRF_WIFI_CONNECT_COMMON_INFO_MAC_ADDR_HINT_VALID (1 << 1)
#define NRF_WIFI_CONNECT_COMMON_INFO_FREQ_VALID (1 << 2)
#define NRF_WIFI_CONNECT_COMMON_INFO_FREQ_HINT_VALID (1 << 3)
#define NRF_WIFI_CONNECT_COMMON_INFO_BG_SCAN_PERIOD_VALID (1 << 4)
#define NRF_WIFI_CONNECT_COMMON_INFO_SSID_VALID (1 << 5)
#define NRF_WIFI_CONNECT_COMMON_INFO_WPA_IE_VALID (1 << 6)
#define NRF_WIFI_CONNECT_COMMON_INFO_WPA_VERSIONS_VALID (1 << 7)
#define NRF_WIFI_CONNECT_COMMON_INFO_CIPHER_SUITES_PAIRWISE_VALID (1 << 8)
#define NRF_WIFI_CONNECT_COMMON_INFO_CIPHER_SUITE_GROUP_VALID (1 << 9)
#define NRF_WIFI_CONNECT_COMMON_INFO_AKM_SUITES_VALID (1 << 10)
#define NRF_WIFI_CONNECT_COMMON_INFO_USE_MFP_VALID (1 << 11)
#define NRF_WIFI_CONNECT_COMMON_INFO_CONTROL_PORT_ETHER_TYPE (1 << 12)
#define NRF_WIFI_CONNECT_COMMON_INFO_CONTROL_PORT_NO_ENCRYPT (1 << 13)

