nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_MAX_NR_AKM_SUITES 2

#define NRF_WIFI_CMD_CONNECT_COMMON_INFO_USE_RRM (1 << 14)
#define NRF_WIFI_CONNECT_COMMON_INFO_PREV_BSSID (1 << 15)
#define NRF_WIFI_CONNECT_COMMON_INFO_SECURITY (1 << 16)
/**
 * @brief This structure contains parameters related to the connection.
 *
 */

struct nrf_wifi_connect_common_info {
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Frequency of the selected channel in MHz */
	unsigned int frequency;
	/** Frequency of the recommended initial BSS */
	unsigned int freq_hint;
	/** Indicates which WPA version(s) */
	unsigned int wpa_versions;
	/** Number of pairwise cipher suites */
	signed int num_cipher_suites_pairwise;
	/** For crypto settings, indicates which pairwise cipher suites are used */
	unsigned int cipher_suites_pairwise[7];
	/** For crypto settings, indicates which group cipher suite is used */
	unsigned int cipher_suite_group;
	/** Number of groupwise cipher suites */
	unsigned int num_akm_suites;
	/** Indicate which key management algorithm(s) to use */
	unsigned int akm_suites[NRF_WIFI_MAX_NR_AKM_SUITES];
	/** Whether management frame protection (IEEE 802.11w) is used for the association */
	signed int use_mfp;
	/** Flag for indicating whether the current connection
	 *  shall support Radio Resource Measurements (11k)
	 */
	unsigned int nrf_wifi_flags;
	/** Background scan period in seconds or 0 to disable background scan */
	unsigned short bg_scan_period;
	/** MAC address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** MAC address recommendation as initial BSS */
	unsigned char mac_addr_hint[NRF_WIFI_ETH_ADDR_LEN];
	/** SSID (binary attribute, 0..32 octets) */
	struct nrf_wifi_ssid ssid;
	/** IE's nrf_wifi_ie */
	struct nrf_wifi_ie wpa_ie;
	/** A 16-bit value indicating the ethertype that will be used for key negotiation.
	 *  If it is not specified, the value defaults to 0x888E.
	 */
	unsigned short control_port_ether_type;
	/** When included along with control_port_ether_type, indicates that the custom
	 *  ethertype frames used for key negotiation must not be encrypted.
	 */
	unsigned char control_port_no_encrypt;
	/** Indicating whether user space controls IEEE 802.1X port, If set, the RPU will
	 *  assume that the port is unauthorized until authorized by user space.
	 *  Otherwise, port is marked authorized by default in station mode.
	 */
	signed char control_port;
	/** previous BSSID, used to specify a request to reassociate
	 *  within an ESS that is, to use Reassociate Request frame (with the value of
	 *  this attribute in the Current AP address field) instead of Association
	 *  Request frame which is used for the initial association to an ESS.
	 */
	unsigned char prev_bssid[NRF_WIFI_ETH_ADDR_LEN];
	/** Bss max idle timeout value in sec which will be encapsulated into
	 *  BSS MAX IDLE IE in assoc request frame.
	 */
	unsigned short maxidle_insec;

} __NRF_WIFI_PKD;

#define NRF_WIFI_BEACON_DATA_MAX_HEAD_LEN 256
#define NRF_WIFI_BEACON_DATA_MAX_TAIL_LEN 512
#define NRF_WIFI_BEACON_DATA_MAX_PROBE_RESP_LEN 400


/**
 * @brief This structure provides information about bss color code.
 *
 */
struct nrf_wifi_he_bss_color {
	/** Current HE bss color */
	unsigned char nrf_wifi_colour;
	/** enable HE bss color */
	unsigned char nrf_wifi_enabled;
	/** Partial AID equation define */
	unsigned char nrf_wifi_partial;
} __NRF_WIFI_PKD;

/**
 * @brief This structure provides information about beacon and probe data.
 *
 */

struct nrf_wifi_beacon_data {
	/** length of head */
	unsigned int head_len;
	/** length of tail */
	unsigned int tail_len;
	/** length of probe response template (probe_resp) */
	unsigned int probe_resp_len;
	/**  head portion of beacon (before TIM IE) or %NULL if not changed  */
	unsigned char head[NRF_WIFI_BEACON_DATA_MAX_HEAD_LEN];
	/** tail portion of beacon (after TIM IE) or %NULL if not changed */
	unsigned char tail[NRF_WIFI_BEACON_DATA_MAX_TAIL_LEN];
	/** probe response template */
	unsigned char probe_resp[NRF_WIFI_BEACON_DATA_MAX_PROBE_RESP_LEN];
	/** Checking bss colour information */
	struct nrf_wifi_he_bss_color he_bss_color;
	/** Checking bss color valid or not */
	unsigned char he_bss_color_valid;
} __NRF_WIFI_PKD;

#define NRF_WIFI_STA_FLAG_INVALID (1 << 0)
#define NRF_WIFI_STA_FLAG_AUTHORIZED (1 << 1)
#define NRF_WIFI_STA_FLAG_SHORT_PREAMBLE (1 << 2)
#define NRF_WIFI_STA_FLAG_WME (1 << 3)
#define NRF_WIFI_STA_FLAG_MFP (1 << 4)
#define NRF_WIFI_STA_FLAG_AUTHENTICATED (1 << 5)
#define NRF_WIFI_STA_FLAG_TDLS_PEER (1 << 6)
#define NRF_WIFI_STA_FLAG_ASSOCIATED (1 << 7)

/**
 * @brief This structure provides information regarding station flags.
 *
 */

struct nrf_wifi_sta_flag_update {
	/** Mask of station flags to set */
	unsigned int nrf_wifi_mask;
	/** Values to set them to. NRF_WIFI_STA_FLAG_AUTHORIZED */
	unsigned int nrf_wifi_set;
} __NRF_WIFI_PKD;

#define NRF_WIFI_RATE_INFO_BITRATE_VALID (1 << 0)
#define NRF_WIFI_RATE_INFO_BITRATE_COMPAT_VALID (1 << 1)
#define NRF_WIFI_RATE_INFO_BITRATE_MCS_VALID (1 << 2)
#define NRF_WIFI_RATE_INFO_BITRATE_VHT_MCS_VALID (1 << 3)
#define NRF_WIFI_RATE_INFO_BITRATE_VHT_NSS_VALID (1 << 4)

#define NRF_WIFI_RATE_INFO_0_MHZ_WIDTH (1 << 0)
#define NRF_WIFI_RATE_INFO_5_MHZ_WIDTH (1 << 1)
#define NRF_WIFI_RATE_INFO_10_MHZ_WIDTH (1 << 2)
#define NRF_WIFI_RATE_INFO_40_MHZ_WIDTH (1 << 3)
#define NRF_WIFI_RATE_INFO_80_MHZ_WIDTH (1 << 4)
#define NRF_WIFI_RATE_INFO_160_MHZ_WIDTH (1 << 5)
#define NRF_WIFI_RATE_INFO_SHORT_GI (1 << 6)
#define NRF_WIFI_RATE_INFO_80P80_MHZ_WIDTH (1 << 7)

/**
 * @brief This structure contains information about rate parameters.
 *
 */

struct nrf_wifi_rate_info {
	/** Valid fields with in this structure */
	unsigned int valid_fields;
	/** bitrate */
	unsigned int bitrate;
	/** Bitrate compatible */
	unsigned short bitrate_compat;
	/** Modulation and Coding Scheme(MCS) */
	unsigned char nrf_wifi_mcs;
	/** MCS related to VHT */
	unsigned char vht_mcs;
	/** NSS related to VHT */
	unsigned char vht_nss;
	/** Rate flags NRF_WIFI_RATE_INFO_0_MHZ_WIDTH */
	unsigned int nrf_wifi_flags;

} __NRF_WIFI_PKD;

#define NRF_WIFI_BSS_PARAM_FLAGS_CTS_PROT (1<<0)
#define NRF_WIFI_BSS_PARAM_FLAGS_SHORT_PREAMBLE (1<<1)
#define NRF_WIFI_BSS_PARAM_FLAGS_SHORT_SLOT_TIME (1<<2)

/**
 * @brief This structure provides information about the Basic Service Set (BSS)
 *  parameters for the attached station.
 *
 */
struct nrf_wifi_sta_bss_parameters {
	/** bitfields of flags NRF_WIFI_BSS_PARAM_FLAGS_CTS_PROT */
	unsigned char nrf_wifi_flags;
	/** DTIM period for the BSS */
	unsigned char dtim_period;
	/** beacon interval */
	unsigned short beacon_interval;
} __NRF_WIFI_PKD;

