nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_STA_INFO_CONNECTED_TIME_VALID (1 << 0)
#define NRF_WIFI_STA_INFO_INACTIVE_TIME_VALID (1 << 1)
#define NRF_WIFI_STA_INFO_RX_BYTES_VALID (1 << 2)
#define NRF_WIFI_STA_INFO_TX_BYTES_VALID (1 << 3)
#define NRF_WIFI_STA_INFO_CHAIN_SIGNAL_VALID (1 << 4)
#define NRF_WIFI_STA_INFO_CHAIN_SIGNAL_AVG_VALID (1 << 5)
#define NRF_WIFI_STA_INFO_TX_BITRATE_VALID (1 << 6)
#define NRF_WIFI_STA_INFO_RX_BITRATE_VALID (1 << 7)
#define NRF_WIFI_STA_INFO_STA_FLAGS_VALID (1 << 8)

#define NRF_WIFI_STA_INFO_LLID_VALID (1 << 9)
#define NRF_WIFI_STA_INFO_PLID_VALID (1 << 10)
#define NRF_WIFI_STA_INFO_PLINK_STATE_VALID (1 << 11)
#define NRF_WIFI_STA_INFO_SIGNAL_VALID (1 << 12)
#define NRF_WIFI_STA_INFO_SIGNAL_AVG_VALID (1 << 13)
#define NRF_WIFI_STA_INFO_RX_PACKETS_VALID (1 << 14)
#define NRF_WIFI_STA_INFO_TX_PACKETS_VALID (1 << 15)
#define NRF_WIFI_STA_INFO_TX_RETRIES_VALID (1 << 16)
#define NRF_WIFI_STA_INFO_TX_FAILED_VALID (1 << 17)
#define NRF_WIFI_STA_INFO_EXPECTED_THROUGHPUT_VALID (1 << 18)
#define NRF_WIFI_STA_INFO_BEACON_LOSS_COUNT_VALID (1 << 19)
#define NRF_WIFI_STA_INFO_LOCAL_PM_VALID (1 << 20)
#define NRF_WIFI_STA_INFO_PEER_PM_VALID (1 << 21)
#define NRF_WIFI_STA_INFO_NONPEER_PM_VALID (1 << 22)
#define NRF_WIFI_STA_INFO_T_OFFSET_VALID (1 << 23)
#define NRF_WIFI_STA_INFO_RX_DROPPED_MISC_VALID (1 << 24)
#define NRF_WIFI_STA_INFO_RX_BEACON_VALID (1 << 25)
#define NRF_WIFI_STA_INFO_RX_BEACON_SIGNAL_AVG_VALID (1 << 26)
#define NRF_WIFI_STA_INFO_STA_BSS_PARAMS_VALID (1 << 27)
#define NRF_WIFI_IEEE80211_MAX_CHAINS 4

/**
 * @brief This structure contains information about a Station (STA).
 *
 */

struct nrf_wifi_sta_info {
	/** Valid fields with in this structure */
	unsigned int valid_fields;
	/** time since the station is last connected */
	unsigned int connected_time;
	/** time since last activity, in msec */
	unsigned int inactive_time;
	/** total received bytes from this station */
	unsigned int rx_bytes;
	/** total transmitted bytes to this station */
	unsigned int tx_bytes;
	/** per-chain signal mask value */
	unsigned int chain_signal_mask;
	/** per-chain signal strength of last PPDU */
	unsigned char chain_signal[NRF_WIFI_IEEE80211_MAX_CHAINS];
	/** per-chain signal strength average mask value */
	unsigned int chain_signal_avg_mask;
	/** per-chain signal strength average */
	unsigned char chain_signal_avg[NRF_WIFI_IEEE80211_MAX_CHAINS];
	/**nrf_wifi_rate_info */
	struct nrf_wifi_rate_info tx_bitrate;
	/**nrf_wifi_rate_info */
	struct nrf_wifi_rate_info rx_bitrate;
	/** Not used */
	unsigned short llid;
	/** Not used */
	unsigned short plid;
	/** Not used */
	unsigned char plink_state;
	/** signal strength of last received PPDU, in dbm */
	signed int signal;
	/** signal strength average, in dbm */
	signed int signal_avg;
	/** total received packet from this station */
	unsigned int rx_packets;
	/** total transmitted packets to this station */
	unsigned int tx_packets;
	/** total retries to this station */
	unsigned int tx_retries;
	/** total failed packets to this station */
	unsigned int tx_failed;
	/** expected throughput in kbps */
	unsigned int expected_throughput;
	/** count of times beacon loss was detected */
	unsigned int beacon_loss_count;
	/** Not used */
	unsigned int local_pm;
	/** Not used */
	unsigned int peer_pm;
	/** Not used */
	unsigned int nonpeer_pm;
	/** station flags nrf_wifi_sta_flag_update */
	struct nrf_wifi_sta_flag_update sta_flags;
	/** timing offset with respect to this STA */
	unsigned long long t_offset;
	/** count of times other(non beacon) loss was detected */
	unsigned long long rx_dropped_misc;
	/** count of times beacon */
	unsigned long long rx_beacon;
	/** average of beacon signal */
	long long rx_beacon_signal_avg;
	/** Station connected BSS params. nrf_wifi_sta_bss_parameters */
	struct nrf_wifi_sta_bss_parameters bss_param;
} __NRF_WIFI_PKD;

/**
 * @brief The command header expected by UMAC to handle requests from the control interface.
 *
 */

struct nrf_wifi_umac_hdr {
	/** unused */
	unsigned int portid;
	/** unused */
	unsigned int seq;
	/** UMAC command/event value see &enum nrf_wifi_umac_commands
	 *  see &enum nrf_wifi_umac_events
	 */
	unsigned int cmd_evnt;
	/** unused */
	signed int rpu_ret_val;
	/** Interface information nrf_wifi_index_ids */
	struct nrf_wifi_index_ids ids;
} __NRF_WIFI_PKD;

#define NRF_WIFI_KEY_VALID (1 << 0)
#define NRF_WIFI_KEY_TYPE_VALID (1 << 1)
#define NRF_WIFI_KEY_IDX_VALID (1 << 2)
#define NRF_WIFI_SEQ_VALID (1 << 3)
#define NRF_WIFI_CIPHER_SUITE_VALID (1 << 4)
#define NRF_WIFI_KEY_INFO_VALID (1 << 5)

#define NRF_WIFI_KEY_DEFAULT (1 << 0)
#define NRF_WIFI_KEY_DEFAULT_TYPES (1 << 1)
#define NRF_WIFI_KEY_DEFAULT_MGMT (1 << 2)
#define NRF_WIFI_KEY_DEFAULT_TYPE_UNICAST (1 << 3)
#define NRF_WIFI_KEY_DEFAULT_TYPE_MULTICAST (1 << 4)
#define NRF_WIFI_KEY_DEFAULT_BEACON (1 << 5)
/**
 * @brief This structure contains information about a security key.
 *
 */

struct nrf_wifi_umac_key_info {
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Key cipher suite (as defined by IEEE 802.11 section 7.3.2.25.1) */
	unsigned int cipher_suite;
	/** Specify what a key should be set as default as example NRF_WIFI_KEY_DEFAULT_MGMT */
	unsigned short nrf_wifi_flags;
	/** Key Type, see &enum nrf_wifi_key_type */
	signed int key_type;
	/** Key data nrf_wifi_key */
	struct nrf_wifi_key key;
	/** Transmit key sequence number (IV/PN) for TKIP and CCMP keys,
	 *  each six bytes in little endian nrf_wifi_seq
	 */
	struct nrf_wifi_seq seq;
	/** Key ID (0-3) */
	unsigned char key_idx;
} __NRF_WIFI_PKD;



/**
 * @brief This enum describes the different types of scan.
 *
 */
enum scan_reason {
	/** scan for display purpose in user space */
	SCAN_DISPLAY = 0,
	/** scan for connection purpose */
	SCAN_CONNECT
};

/**
 * @brief This structure contains details about scan request information.
 *
 */
struct nrf_wifi_umac_scan_info {
	/** scan type see &enum scan_reason */
	signed int scan_reason;
	/** scan_db address */
	unsigned int scan_db_addr;
	/** max scan results count */
	unsigned int scan_db_len;
	/** scan parameters nrf_wifi_scan_params */
	struct nrf_wifi_scan_params scan_params;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command scan request.
 *
 */

struct nrf_wifi_umac_cmd_scan {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_scan_info */
	struct nrf_wifi_umac_scan_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command to abort a scan request.
 *
 */

