nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
struct nrf_wifi_umac_cmd_abort_scan {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief TThis structure defines a command to request scan results.
 * This command should be executed only if we have received a
 * NRF_WIFI_UMAC_EVENT_SCAN_DONE event for a previous scan.
 *
 */

struct nrf_wifi_umac_cmd_get_scan_results {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** scan type see &enum scan_reason */
	signed int scan_reason;
} __NRF_WIFI_PKD;

/**
 * @brief This structure provides details about the "Scan Done" event.
 *
 */
struct nrf_wifi_umac_event_scan_done {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** status, 0=Scan successful & 1=Scan aborted */
	signed int status;
	/** scan type see &enum scan_reason */
	unsigned int scan_type;
	/** no of scan results */
	unsigned int scan_results_cnt;
	/** scan_db address. Each scan result is of type
	 *  see &struct umac_display_results.
	 */
	unsigned int scan_db_addr;
} __NRF_WIFI_PKD;


#define MCAST_ADDR_ADD 0
#define MCAST_ADDR_DEL 1

/**
 * @brief This structure represents the parameters used to configure the multicast address filter.
 *
 */
struct nrf_wifi_umac_mcast_cfg {
	/** Add (0) or Delete (1) */
	unsigned int type;
	/** multicast address to be added/deleted */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command used to set multicast (mcast) addresses.
 *
 */
struct nrf_wifi_umac_cmd_mcast_filter {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_mcast_cfg */
	struct nrf_wifi_umac_mcast_cfg info;
} __NRF_WIFI_PKD;


/**
 * @brief This structure represents the parameters used to change the MAC address.
 *
 */

struct nrf_wifi_umac_change_macaddr_info {
	/** MAC address to be set */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
} __NRF_WIFI_PKD;
/**
 * @brief This structure describes command to change MAC address.
 *  This has to be used only when the interface is down.
 *
 */
struct nrf_wifi_umac_cmd_change_macaddr {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_change_macaddr_info */
	struct nrf_wifi_umac_change_macaddr_info macaddr_info;
} __NRF_WIFI_PKD;



#define NRF_WIFI_CMD_AUTHENTICATE_KEY_INFO_VALID (1 << 0)
#define NRF_WIFI_CMD_AUTHENTICATE_BSSID_VALID (1 << 1)
#define NRF_WIFI_CMD_AUTHENTICATE_FREQ_VALID (1 << 2)
#define NRF_WIFI_CMD_AUTHENTICATE_SSID_VALID (1 << 3)
#define NRF_WIFI_CMD_AUTHENTICATE_IE_VALID (1 << 4)
#define NRF_WIFI_CMD_AUTHENTICATE_SAE_VALID (1 << 5)

/**
 * @brief This structure specifies the parameters to be used when sending an authentication request.
 *
 */

struct nrf_wifi_umac_auth_info {
	/** Frequency of the selected channel in MHz */
	unsigned int frequency;
	/** Authentication type. see &enum nrf_wifi_auth_type */
	signed int auth_type;
	/** Key information */
	struct nrf_wifi_umac_key_info key_info;
	/** SSID (binary attribute, 0..32 octets) */
	struct nrf_wifi_ssid ssid;
	/** Information element(s) data */
	struct nrf_wifi_ie ie;
	/** SAE elements in Authentication frames. This starts
	 *  with the Authentication transaction sequence number field.
	 */
	struct nrf_wifi_sae sae;
	/** MAC address (various uses) */
	unsigned char nrf_wifi_bssid[NRF_WIFI_ETH_ADDR_LEN];
	/** scanning width */
	signed int scan_width;
	/** Signal strength */
	signed int nrf_wifi_signal;
	/** Received elements from beacon or probe response */
	signed int from_beacon;
	/** BSS information element data */
	struct nrf_wifi_ie bss_ie;
	/** BSS capability */
	unsigned short capability;
	/** Beacon interval(ms) */
	unsigned short beacon_interval;
	/** Beacon tsf */
	unsigned long long tsf;
	/** Indicate local state change without actual authentication frame exchange */
	unsigned char local_state_change;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command used to send an authentication request.
 *
 */

struct nrf_wifi_umac_cmd_auth {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the auth info parameters are valid */
	unsigned int valid_fields;
	/** Information to be passed in the authentication command nrf_wifi_umac_auth_info */
	struct nrf_wifi_umac_auth_info info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_ASSOCIATE_MAC_ADDR_VALID (1 << 0)


/**
 * @brief This structure specifies the parameters to be used when sending an association request.
 *
 */

struct nrf_wifi_umac_cmd_assoc {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** nrf_wifi_connect_common_info */
	struct nrf_wifi_connect_common_info connect_common_info;
	/** MAC address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_MLME_MAC_ADDR_VALID (1 << 0)
#define NRF_WIFI_CMD_MLME_LOCAL_STATE_CHANGE (1 << 0)

/**
 * @brief This structure specifies the parameters to be passed while sending a
 *  deauthentication request (NRF_WIFI_UMAC_CMD_DEAUTHENTICATE).
 *
 */

struct nrf_wifi_umac_disconn_info {
	/** Indicates that a command is requesting a local deauthentication/disassociation
	 *  state change without invoking actual management frame exchange.
	 */
	unsigned short nrf_wifi_flags;
	/** Reason code for disassociation or deauthentication */
	unsigned short reason_code;
	/** MAC address (various uses) */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
} __NRF_WIFI_PKD;

/**
 * @brief This structure specifies the parameters to be used when sending a disconnect request.
 *
 */

struct nrf_wifi_umac_cmd_disconn {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** nrf_wifi_umac_disconn_info */
	struct nrf_wifi_umac_disconn_info info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_NEW_INTERFACE_USE_4ADDR_VALID (1 << 0)
#define NRF_WIFI_CMD_NEW_INTERFACE_MAC_ADDR_VALID (1 << 1)
#define NRF_WIFI_CMD_NEW_INTERFACE_IFTYPE_VALID (1 << 2)
#define NRF_WIFI_CMD_NEW_INTERFACE_IFNAME_VALID (1 << 3)

/**
 * @brief This structure contains the information to be passed to the RPU
 *  to create a new virtual interface using the NRF_WIFI_UMAC_CMD_NEW_INTERFACE command.
 *
 */
struct nrf_wifi_umac_add_vif_info {
	/** Interface type, see enum nrf_wifi_sys_iftype */
	signed int iftype;
	/** Use 4-address frames on a virtual interface */
	signed int nrf_wifi_use_4addr;
	/** Unused */
	unsigned int mon_flags;
	/** MAC Address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Interface name */
	signed char ifacename[16];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command used to create a new virtual interface
 *  using the NRF_WIFI_UMAC_CMD_NEW_INTERFACE command.
 *
 */

struct nrf_wifi_umac_cmd_add_vif {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** VIF specific information to be passed to the RPU nrf_wifi_umac_add_vif_info */
	struct nrf_wifi_umac_add_vif_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command used to delete a virtual interface.
 *  However, this command is not allowed on the default interface.
 *
 */

struct nrf_wifi_umac_cmd_del_vif {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

#define NRF_WIFI_FRAME_MATCH_MAX_LEN 8

/**
 * @brief This structure represents the data of management frame that must be matched for
 *  processing in userspace.
 *
 */

struct nrf_wifi_umac_frame_match {
	/** Length of data */
	unsigned int frame_match_len;
	/** Data to match */
	unsigned char frame_match[NRF_WIFI_FRAME_MATCH_MAX_LEN];
} __NRF_WIFI_PKD;

/**
 * @brief This structure contains information about the type of management frame
 *  that should be passed to the driver for processing in userspace.
 *
 */

struct nrf_wifi_umac_mgmt_frame_info {
	/** Frame type/subtype */
	unsigned short frame_type;
	/** Match information Refer &struct nrf_wifi_umac_frame_match */
	struct nrf_wifi_umac_frame_match frame_match;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command to inform the RPU to register a management frame,
 *  which must not be filtered by the RPU and should instead be passed to the host for
 *  userspace processing.
 *
 */

struct nrf_wifi_umac_cmd_mgmt_frame_reg {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/**
	 * Management frame specific information to be passed to the RPU.
	 * nrf_wifi_umac_mgmt_frame_info
	 */
	struct nrf_wifi_umac_mgmt_frame_info info;
} __NRF_WIFI_PKD;

