nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_CMD_KEY_MAC_ADDR_VALID (1 << 0)

/**
 * @brief This structure represents command to add a new key.
 *
 */

struct nrf_wifi_umac_cmd_key {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Key information. nrf_wifi_umac_key_info */
	struct nrf_wifi_umac_key_info key_info;
	/** MAC address associated with the key */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/* Peer Key DB index */
	unsigned char peerDBIndex;

} __NRF_WIFI_PKD;

/**
 * @brief This structure defines a command that is used to add a new key.
 *
 */

struct nrf_wifi_umac_cmd_set_key {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Key information , nrf_wifi_umac_key_info */
	struct nrf_wifi_umac_key_info key_info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_SET_BSS_CTS_VALID (1 << 0)
#define NRF_WIFI_CMD_SET_BSS_PREAMBLE_VALID (1 << 1)
#define NRF_WIFI_CMD_SET_BSS_SLOT_VALID (1 << 2)
#define NRF_WIFI_CMD_SET_BSS_HT_OPMODE_VALID (1 << 3)
#define NRF_WIFI_CMD_SET_BSS_AP_ISOLATE_VALID (1 << 4)
#define NRF_WIFI_CMD_SET_BSS_P2P_CTWINDOW_VALID (1 << 5)
#define NRF_WIFI_CMD_SET_BSS_P2P_OPPPS_VALID (1 << 6)

#define NRF_WIFI_BASIC_MAX_SUPP_RATES 32

/**
 * @brief This structure contains parameters that describe the BSS (Basic Service Set) information.
 *
 */

struct nrf_wifi_umac_bss_info {
	/** P2P GO Client Traffic Window, used with
	 *  the START_AP and SET_BSS commands.
	 */
	unsigned int p2p_go_ctwindow;
	/** P2P GO opportunistic PS, used with the
	 *  START_AP and SET_BSS commands. This can have the values 0 or 1;
	 *  if not given in START_AP 0 is assumed, if not given in SET_BSS
	 *  no change is made.
	 */
	unsigned int p2p_opp_ps;
	/** Number of basic rate elements */
	unsigned int num_basic_rates;
	/** HT operation mode */
	unsigned short ht_opmode;
	/** Whether CTS protection is enabled (0 or 1) */
	unsigned char nrf_wifi_cts;
	/** Whether short preamble is enabled (0 or 1) */
	unsigned char preamble;
	/** Whether short slot time enabled (0 or 1) */
	unsigned char nrf_wifi_slot;
	/** (AP mode) Do not forward traffic between stations connected to this BSS */
	unsigned char ap_isolate;
	/** Basic rates, array of basic rates in format defined by IEEE 802.11 7.3.2.2 */
	unsigned char basic_rates[NRF_WIFI_BASIC_MAX_SUPP_RATES];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents a command used to set BSS (Basic Service Set) parameters.
 *
 */

struct nrf_wifi_umac_cmd_set_bss {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** BSS specific information to be passed to the RPU nrf_wifi_umac_bss_info */
	struct nrf_wifi_umac_bss_info bss_info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_SET_FREQ_PARAMS_FREQ_VALID (1 << 0)
#define NRF_WIFI_SET_FREQ_PARAMS_CHANNEL_WIDTH_VALID (1 << 1)
#define NRF_WIFI_SET_FREQ_PARAMS_CENTER_FREQ1_VALID (1 << 2)
#define NRF_WIFI_SET_FREQ_PARAMS_CENTER_FREQ2_VALID (1 << 3)
#define NRF_WIFI_SET_FREQ_PARAMS_CHANNEL_TYPE_VALID (1 << 4)

/**
 * @brief This structure contains information about frequency parameters.
 *
 */

struct freq_params {
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Value in MHz */
	signed int frequency;
	/** Width of the channel @see &enu nrf_wifi_chan_width */
	signed int channel_width;
	/** Unused */
	signed int center_frequency1;
	/** Unused */
	signed int center_frequency2;
	/** Type of channel see &enum nrf_wifi_channel_type */
	signed int channel_type;
} __NRF_WIFI_PKD;

/**
 * @brief This structure contains information about transmit queue parameters.
 *
 */

struct nrf_wifi_txq_params {
	/** Transmit oppurtunity */
	unsigned short txop;
	/** Minimum contention window */
	unsigned short cwmin;
	/** Maximum contention window */
	unsigned short cwmax;
	/** Arbitration interframe spacing */
	unsigned char aifs;
	/** Access category */
	unsigned char ac;

} __NRF_WIFI_PKD;

/**
 * @brief Types of transmit power settings.
 *
 */

enum nrf_wifi_tx_power_type {
	/** Automatically determine transmit power */
	NRF_WIFI_TX_POWER_AUTOMATIC,
	/** Limit TX power by the mBm parameter */
	NRF_WIFI_TX_POWER_LIMITED,
	/** Fix TX power to the mBm parameter */
	NRF_WIFI_TX_POWER_FIXED,
};

#define NRF_WIFI_TX_POWER_SETTING_TYPE_VALID (1 << 0)
#define NRF_WIFI_TX_POWER_SETTING_TX_POWER_LEVEL_VALID (1 << 1)

/**
 * @brief This structure contains the parameters related to the transmit power setting.
 *
 */

struct nrf_wifi_tx_power_setting {
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Power value type, see nrf_wifi_tx_power_type */
	signed int type;
	/** Transmit power level in signed mBm units */
	signed int tx_power_level;

} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_SET_WIPHY_FREQ_PARAMS_VALID (1 << 0)
#define NRF_WIFI_CMD_SET_WIPHY_TXQ_PARAMS_VALID (1 << 1)
#define NRF_WIFI_CMD_SET_WIPHY_RTS_THRESHOLD_VALID (1 << 2)
#define NRF_WIFI_CMD_SET_WIPHY_FRAG_THRESHOLD_VALID (1 << 3)
#define NRF_WIFI_CMD_SET_WIPHY_TX_POWER_SETTING_VALID (1 << 4)
#define NRF_WIFI_CMD_SET_WIPHY_ANTENNA_TX_VALID (1 << 5)
#define NRF_WIFI_CMD_SET_WIPHY_ANTENNA_RX_VALID (1 << 6)
#define NRF_WIFI_CMD_SET_WIPHY_RETRY_SHORT_VALID (1 << 7)
#define NRF_WIFI_CMD_SET_WIPHY_RETRY_LONG_VALID (1 << 8)
#define NRF_WIFI_CMD_SET_WIPHY_COVERAGE_CLASS_VALID (1 << 9)
#define NRF_WIFI_CMD_SET_WIPHY_WIPHY_NAME_VALID (1 << 10)

/**
 * @brief This structure contains information about the configuration parameters
 *  needed to set up and configure the wireless Physical Layer.
 *
 */

struct nrf_wifi_umac_set_wiphy_info {
	/** RTS threshold, TX frames with length larger than or equal to this use RTS/CTS handshake
	 *  allowed range: 0..65536, disable with -1.
	 */
	int rts_threshold;
	/** Fragmentation threshold, maximum length in octets for frames.
	 *  allowed range: 256..8000, disable fragmentation with (u32)-1.
	 */
	unsigned int frag_threshold;
	/** Bitmap of allowed antennas for transmitting. This can be used to mask out
	 *  antennas which are not attached or should not be used for transmitting.
	 *  If an antenna is not selected in this bitmap the hardware is not allowed
	 *  to transmit on this antenna.
	 */
	unsigned int antenna_tx;
	/** Bitmap of allowed antennas for receiving. This can be used to mask out antennas
	 *  which are not attached or should not be used for receiving. If an antenna is
	 *  not selected in this bitmap the hardware should not be configured to receive
	 *  on this antenna.
	 */
	unsigned int antenna_rx;
	/** Frequency information of the a channel see &struct freq_params */
	struct freq_params freq_params;
	/** TX queue parameters nrf_wifi_txq_params */
	struct nrf_wifi_txq_params txq_params;
	/** Tx power settings nrf_wifi_tx_power_setting nrf_wifi_tx_power_setting */
	struct nrf_wifi_tx_power_setting tx_power_setting;
	/** TX retry limit for frames whose length is less than or equal to the RTS threshold
	 *  allowed range: 1..255.
	 */
	unsigned char retry_short;
	/** TX retry limit for frames whose length is greater than the RTS threshold
	 *  allowed range: 1..255.
	 */
	unsigned char retry_long;
	/** Unused */
	unsigned char coverage_class;
	/** WIPHY name (used for renaming) */
	signed char wiphy_name[32];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command to set the wireless PHY configuration.
 *
 */

struct nrf_wifi_umac_cmd_set_wiphy {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicates which of the following parameters are valid */
	unsigned int valid_fields;
	/** nrf_wifi_umac_set_wiphy_info */
	struct nrf_wifi_umac_set_wiphy_info info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_DEL_STATION_MAC_ADDR_VALID (1 << 0)
#define NRF_WIFI_CMD_DEL_STATION_MGMT_SUBTYPE_VALID (1 << 1)
#define NRF_WIFI_CMD_DEL_STATION_REASON_CODE_VALID (1 << 2)

/**
 * @brief This structure contains the parameters to delete a station.
 *
 */

struct nrf_wifi_umac_del_sta_info {
	/** MAC address of the station */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Management frame subtype */
	unsigned char mgmt_subtype;
	/** Reason code for DEAUTHENTICATION and DISASSOCIATION */
	unsigned short reason_code;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command to delete a station.
 *
 */

