nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
struct nrf_wifi_umac_cmd_del_sta {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Information regarding the station to be deleted nrf_wifi_umac_del_sta_info */
	struct nrf_wifi_umac_del_sta_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure contains the information required for obtaining station details.
 *
 */

struct nrf_wifi_umac_get_sta_info {
	/** MAC address of the station */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command to get station information.
 *
 */

struct nrf_wifi_umac_cmd_get_sta {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Information regarding the station to get nrf_wifi_umac_get_sta_info */
	struct nrf_wifi_umac_get_sta_info info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_EXT_CAPABILITY_MAX_LEN 32

/**
 * @brief Extended capability information.
 */

struct nrf_wifi_ext_capability {
	/** length */
	unsigned int ext_capability_len;
	/** Extended capability info*/
	unsigned char ext_capability[NRF_WIFI_EXT_CAPABILITY_MAX_LEN];

} __NRF_WIFI_PKD;

#define NRF_WIFI_SUPPORTED_CHANNELS_MAX_LEN 89

/**
 * @brief Supported channels.
 */

struct nrf_wifi_supported_channels {
	/** number of channels */
	unsigned int supported_channels_len;
	/** channels info */
	unsigned char supported_channels[NRF_WIFI_SUPPORTED_CHANNELS_MAX_LEN];

} __NRF_WIFI_PKD;

#define NRF_WIFI_OPER_CLASSES_MAX_LEN 64

/**
 * @brief Operating classes information.
 */
struct nrf_wifi_supported_oper_classes {
	/** length */
	unsigned int supported_oper_classes_len;
	/** oper_class info*/
	unsigned char supported_oper_classes[NRF_WIFI_OPER_CLASSES_MAX_LEN];

} __NRF_WIFI_PKD;

#define NRF_WIFI_STA_FLAGS2_MAX_LEN 64

/**
 * @brief Station flags.
 */

struct nrf_wifi_sta_flags2 {
	/** length */
	unsigned int sta_flags2_len;
	/** flags */
	unsigned char sta_flags2[NRF_WIFI_STA_FLAGS2_MAX_LEN];

} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_NEW_STATION_SUPP_RATES_VALID (1 << 0)
#define NRF_WIFI_CMD_NEW_STATION_AID_VALID (1 << 1)
#define NRF_WIFI_CMD_NEW_STATION_PEER_AID_VALID (1 << 2)
#define NRF_WIFI_CMD_NEW_STATION_STA_CAPABILITY_VALID (1 << 3)
#define NRF_WIFI_CMD_NEW_STATION_EXT_CAPABILITY_VALID (1 << 4)
#define NRF_WIFI_CMD_NEW_STATION_STA_VLAN_VALID (1 << 5)
#define NRF_WIFI_CMD_NEW_STATION_HT_CAPABILITY_VALID (1 << 6)
#define NRF_WIFI_CMD_NEW_STATION_VHT_CAPABILITY_VALID (1 << 7)
#define NRF_WIFI_CMD_NEW_STATION_HE_CAPABILITY_VALID (1 << 8)
#define NRF_WIFI_CMD_NEW_STATION_OPMODE_NOTIF_VALID (1 << 9)
#define NRF_WIFI_CMD_NEW_STATION_SUPPORTED_CHANNELS_VALID (1 << 10)
#define NRF_WIFI_CMD_NEW_STATION_SUPPORTED_OPER_CLASSES_VALID (1 << 11)
#define NRF_WIFI_CMD_NEW_STATION_STA_FLAGS2_VALID (1 << 12)
#define NRF_WIFI_CMD_NEW_STATION_STA_WME_UAPSD_QUEUES_VALID (1 << 13)
#define NRF_WIFI_CMD_NEW_STATION_STA_WME_MAX_SP_VALID (1 << 14)
#define NRF_WIFI_CMD_NEW_STATION_LISTEN_INTERVAL_VALID (1 << 15)
#define NRF_WIFI_MLD_ADDR_VALID (1<<16)
#define NRF_WIFI_CMD_NEW_STATION_6GHZ_CAPABILITY_VALID (1 << 17)

#define NRF_WIFI_HT_MCS_MASK_LEN 10
#define NRF_WIFI_HT_MCS_RES_LEN 3

/**
 * @brief MCS information.
 *
 */
struct nrf_wifi_event_mcs_info {
	/** RX mask */
	unsigned char nrf_wifi_rx_mask[NRF_WIFI_HT_MCS_MASK_LEN];
	/** Highest supported RX rate */
	unsigned short nrf_wifi_rx_highest;
	/** TX parameters */
	unsigned char nrf_wifi_tx_params;
	/** reserved */
	unsigned char nrf_wifi_reserved[NRF_WIFI_HT_MCS_RES_LEN];
} __NRF_WIFI_PKD;

/**
 * @brief HT capabilities information.
 *
 */
struct nrf_wifi_sta_ht_cap {
	/** HT capabilities, as in the HT information IE */
	unsigned short nrf_wifi_cap;
	/** HT A-MPDU parameters information */
	unsigned char ampdu_params_info;
	/** MCS information. nrf_wifi_event_mcs_info */
	struct nrf_wifi_event_mcs_info mcs;
	/** HT extended capabilities information */
	unsigned short extended_ht_cap_info;
	/** HT Transmit Beamforming Capabilities information */
	unsigned int tx_BF_cap_info;
	/** HT ASEL Capability information */
	unsigned char antenna_selection_info;
} __NRF_WIFI_PKD;

/**
 * @brief VHT MCS information.
 *
 */

struct nrf_wifi_event_vht_mcs_info {
	/** RX MCS map 2 bits for each stream, total 8 streams */
	unsigned short rx_mcs_map;
	/** Indicates highest long GI VHT PPDU data rate
	 *  STA can receive. Rate expressed in units of 1 Mbps.
	 *  If this field is 0 this value should not be used to
	 *  consider the highest RX data rate supported.
	 */
	unsigned short rx_highest;
	/** TX MCS map 2 bits for each stream, total 8 streams */
	unsigned short tx_mcs_map;
	/** Indicates highest long GI VHT PPDU data rate
	 *  STA can transmit. Rate expressed in units of 1 Mbps.
	 *  If this field is 0 this value should not be used to
	 *  consider the highest TX data rate supported.
	 */
	unsigned short tx_highest;
} __NRF_WIFI_PKD;

/**
 * @brief VHT capabilities information
 *
 */

struct nrf_wifi_sta_vht_cap {
	/** VHT capability , as in the VHT information IE */
	unsigned int nrf_wifi_cap;
	/** MCS supported rates in VHT */
	struct nrf_wifi_event_vht_mcs_info vht_mcs;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents HE mcs support rates.
 *
 */

struct nrf_wifi_he_mcs_nss_supp {
	/** Channel width less than 80MHz,
	 *  Rx MCS map 2 bits for each stream and total 8 streams.
	 */
	unsigned short rx_mcs_80;
	/** Channel width less than 80MHz,
	 *  Tx MCS map 2 bits for each stream and total 8 streams.
	 */
	unsigned short tx_mcs_80;
	/** Channel width 160MHz,
	 *  Rx MCS map 2 bits for each stream and total 8 streams.
	 */
	unsigned short rx_mcs_160;
	/** Channel width 160MHz,
	 *  Tx MCS map 2 bits for each stream and total 8 streams.
	 */
	unsigned short tx_mcs_160;
	/** Channel width less than 80p80MHz,
	 *  Rx MCS map 2 bits for each stream and total 8 streams.
	 */
	unsigned short rx_mcs_80p80;
	/** Channel width less than 80p80MHz,
	 *  Tx MCS map 2 bits for each stream and total 8 streams.
	 */
	unsigned short tx_mcs_80p80;
} __NRF_WIFI_PKD;

/**
 * @brief HE capabilities information.
 *
 */

struct nrf_wifi_he_cap_elem {
	/** HE MAC capabilities information */
	unsigned char mac_cap_info[6];
	/** HE PHY capabilities information */
	unsigned char phy_cap_info[11];
	/** HE MCS support rates information */
	struct nrf_wifi_he_mcs_nss_supp he_mcs_nss_supp;
	/** PPE Thresholds field */
	unsigned char ppe_thres[25];
} __NRF_WIFI_PKD;

/**
 * @brief HE 6Ghz capabilities information.
 *
 */

struct nrf_wifi_event_sta_he_6ghz_cap {
	/** 1 indicates 6ghz HE Supported */
	signed char nrf_wifi_he_6gh_supported;
	/** HE 6Ghz capability, as in the HE 6Ghz information IE */
	unsigned short nrf_wifi_cap;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the information needed to update a station entry
 * in the RPU.
 *
 */

struct nrf_wifi_umac_chg_sta_info {
	/** Listen interval as defined by IEEE 802.11 7.3.1.6 */
	signed int nrf_wifi_listen_interval;
	/** Unused */
	unsigned int sta_vlan;
	/** AID or zero for no change */
	unsigned short aid;
	/** Unused */
	unsigned short nrf_wifi_peer_aid;
	/** Station capability */
	unsigned short sta_capability;
	/** Unused */
	unsigned short spare;
	/** Supported rates in IEEE 802.11 format nrf_wifi_supp_rates */
	struct nrf_wifi_supp_rates supp_rates;
	/** Extended capabilities of the station nrf_wifi_ext_capability */
	struct nrf_wifi_ext_capability ext_capability;
	/** Supported channels in IEEE 802.11 format nrf_wifi_supported_channels */
	struct nrf_wifi_supported_channels supported_channels;
	/** Supported oper classes in IEEE 802.11 format nrf_wifi_supported_oper_classes */
	struct nrf_wifi_supported_oper_classes supported_oper_classes;
	/** station flags mask/set nrf_wifi_sta_flag_update nrf_wifi_sta_flag_update */
	struct nrf_wifi_sta_flag_update sta_flags2;
	/** HT/VHT/HE capabilities of station */
	struct nrf_wifi_sta_ht_cap ht_capability;
	/** VHT capabilities of station */
	struct nrf_wifi_sta_vht_cap vht_capability;
	/** HE capabilities of station */
	struct nrf_wifi_he_cap_elem he_capability;
	/** HE capabilities length of station */
	unsigned char nrf_wifi_he_capa_len;
	/** 6Ghz capabilities of station */
	struct nrf_wifi_event_sta_he_6ghz_cap he_6ghz_capability;
	/** Station mac address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Information if operating mode field is used */
	unsigned char opmode_notif;
	/** Bitmap of queues configured for uapsd. Same format
	 *  as the AC bitmap in the QoS info field.
	 */
	unsigned char wme_uapsd_queues;
	/** Max Service Period. same format as the MAX_SP in the
	 *  QoS info field (but already shifted down).
	 */
	unsigned char wme_max_sp;
} __NRF_WIFI_PKD;

