nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_CMD_SET_STATION_SUPP_RATES_VALID (1 << 0)
#define NRF_WIFI_CMD_SET_STATION_AID_VALID (1 << 1)
#define NRF_WIFI_CMD_SET_STATION_PEER_AID_VALID (1 << 2)
#define NRF_WIFI_CMD_SET_STATION_STA_CAPABILITY_VALID (1 << 3)
#define NRF_WIFI_CMD_SET_STATION_EXT_CAPABILITY_VALID (1 << 4)
#define NRF_WIFI_CMD_SET_STATION_STA_VLAN_VALID (1 << 5)
#define NRF_WIFI_CMD_SET_STATION_HT_CAPABILITY_VALID (1 << 6)
#define NRF_WIFI_CMD_SET_STATION_VHT_CAPABILITY_VALID (1 << 7)
#define NRF_WIFI_CMD_SET_STATION_HE_CAPABILITY_VALID (1 << 8)
#define NRF_WIFI_CMD_SET_STATION_OPMODE_NOTIF_VALID (1 << 9)
#define NRF_WIFI_CMD_SET_STATION_SUPPORTED_CHANNELS_VALID (1 << 10)
#define NRF_WIFI_CMD_SET_STATION_SUPPORTED_OPER_CLASSES_VALID (1 << 11)
#define NRF_WIFI_CMD_SET_STATION_STA_FLAGS2_VALID (1 << 12)
#define NRF_WIFI_CMD_SET_STATION_STA_WME_UAPSD_QUEUES_VALID (1 << 13)
#define NRF_WIFI_CMD_SET_STATION_STA_WME_MAX_SP_VALID (1 << 14)
#define NRF_WIFI_CMD_SET_STATION_LISTEN_INTERVAL_VALID (1 << 15)
#define NRF_WIFI_CMD_SET_STATION_6GHZ_CAPABILITY_VALID (1 << 17)

/**
 * @brief This structure defines the command for updating the parameters of a station entry.
 *
 */

struct nrf_wifi_umac_cmd_chg_sta {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** nrf_wifi_umac_chg_sta_info */
	struct nrf_wifi_umac_chg_sta_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure describes the parameters for adding a new station entry to the RPU.
 *
 */

struct nrf_wifi_umac_add_sta_info {
	/** Listen interval as defined by IEEE 802.11 7.3.1.6 */
	signed int nrf_wifi_listen_interval;
	/** Unused */
	unsigned int sta_vlan;
	/** AID or zero for no change */
	unsigned short aid;
	/** Unused */
	unsigned short nrf_wifi_peer_aid;
	/** Station capability */
	unsigned short sta_capability;
	/** Unused */
	unsigned short spare;
	/** Supported rates in IEEE 802.11 format nrf_wifi_supp_rates */
	struct nrf_wifi_supp_rates supp_rates;
	/** Extended capabilities of the station nrf_wifi_ext_capability */
	struct nrf_wifi_ext_capability ext_capability;
	/** Supported channels in IEEE 802.11 format nrf_wifi_supported_channels */
	struct nrf_wifi_supported_channels supported_channels;
	/** Supported oper classes in IEEE 802.11 format nrf_wifi_supported_oper_classes */
	struct nrf_wifi_supported_oper_classes supported_oper_classes;
	/** station flags mask/set nrf_wifi_sta_flag_update */
	struct nrf_wifi_sta_flag_update sta_flags2;
	/** HT/VHT/HE capabilities of station */
	struct nrf_wifi_sta_ht_cap ht_capability;
	/** VHT capabilities of station */
	struct nrf_wifi_sta_vht_cap vht_capability;
	/** HE capabilities of station */
	struct nrf_wifi_he_cap_elem he_capability;
	/** HE capabilities length of station */
	unsigned char nrf_wifi_he_capa_len;
	/** HE 6Ghz capabilities of station */
	struct nrf_wifi_event_sta_he_6ghz_cap he_6ghz_capability;
	/** Station mac address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Information if operating mode field is used */
	unsigned char opmode_notif;
	/** Bitmap of queues configured for uapsd. same format
	 *  as the AC bitmap in the QoS info field.
	 */
	unsigned char wme_uapsd_queues;
	/** Max Service Period. same format as the MAX_SP in the
	 *  QoS info field (but already shifted down).
	 */
	unsigned char wme_max_sp;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command for adding a new station entry.
 *
 */

struct nrf_wifi_umac_cmd_add_sta {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** nrf_wifi_umac_add_sta_info */
	struct nrf_wifi_umac_add_sta_info info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_BEACON_INFO_BEACON_INTERVAL_VALID (1 << 0)
#define NRF_WIFI_CMD_BEACON_INFO_AUTH_TYPE_VALID (1 << 1)
#define NRF_WIFI_CMD_BEACON_INFO_VERSIONS_VALID (1 << 2)
#define NRF_WIFI_CMD_BEACON_INFO_CIPHER_SUITE_GROUP_VALID (1 << 3)
#define NRF_WIFI_CMD_BEACON_INFO_INACTIVITY_TIMEOUT_VALID (1 << 4)
#define NRF_WIFI_CMD_BEACON_INFO_FREQ_PARAMS_VALID (1 << 5)

#define NRF_WIFI_CMD_BEACON_INFO_PRIVACY (1 << 0)
#define NRF_WIFI_CMD_BEACON_INFO_CONTROL_PORT_NO_ENCRYPT (1 << 1)
#define NRF_WIFI_CMD_BEACON_INFO_P2P_CTWINDOW_VALID (1 << 6)
#define NRF_WIFI_CMD_BEACON_INFO_P2P_OPPPS_VALID (1 << 7)
#define NRF_WIFI_CMD_BEACON_INFO_HE_BSS_COLOR_VALID (1 << 8)

/**
 * @brief This structure describes the parameters required to be passed to the RPU when
 *  initiating a SoftAP (Soft Access Point).
 *
 */

struct nrf_wifi_umac_start_ap_info {
	/** Beacon frame interval */
	unsigned short beacon_interval;
	/** DTIM count */
	unsigned char dtim_period;
	/** Send beacons with wildcard sssid */
	signed int hidden_ssid;
	/** Authentication type, see &enum nrf_wifi_auth_type */
	signed int auth_type;
	/** Unused */
	signed int smps_mode;
	/** Beacon info flags */
	unsigned int nrf_wifi_flags;
	/** Beacon frame, nrf_wifi_beacon_data */
	struct nrf_wifi_beacon_data beacon_data;
	/** SSID string, nrf_wifi_ssid */
	struct nrf_wifi_ssid ssid;
	/** Connect params, nrf_wifi_connect_common_info */
	struct nrf_wifi_connect_common_info connect_common_info;
	/** Channel info, see &struct freq_params */
	struct freq_params freq_params;
	/** Time to stop ap after inactivity period */
	unsigned short inactivity_timeout;
	/** P2P GO Client Traffic Window */
	unsigned char p2p_go_ctwindow;
	/** Opportunistic power save allows P2P Group Owner to save power
	 *  when all its associated clients are sleeping.
	 */
	unsigned char p2p_opp_ps;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command for starting the SoftAP using
 *  NRF_WIFI_UMAC_CMD_NEW_BEACON and NRF_WIFI_UMAC_CMD_START_AP.
 *
 */

struct nrf_wifi_umac_cmd_start_ap {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Parameters that need to be passed to the RPU when starting a SoftAP.
	 *  nrf_wifi_umac_start_ap_info
	 */
	struct nrf_wifi_umac_start_ap_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to stop Soft AP operation.
 *
 */

