nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
struct nrf_wifi_umac_cmd_stop_ap {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the parameters that must be passed to the RPU when
 *  configuring Beacon and Probe response data.
 *
 */

struct nrf_wifi_umac_set_beacon_info {
	/** Beacon frame, nrf_wifi_beacon_data */
	struct nrf_wifi_beacon_data beacon_data;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command for setting the beacon data using
 *  NRF_WIFI_UMAC_CMD_SET_BEACON.
 *
 */

struct nrf_wifi_umac_cmd_set_beacon {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_set_beacon_info */
	struct nrf_wifi_umac_set_beacon_info info;
} __NRF_WIFI_PKD;

#define NRF_WIFI_SET_INTERFACE_IFTYPE_VALID (1 << 0)
#define NRF_WIFI_SET_INTERFACE_USE_4ADDR_VALID (1 << 1)

/**
 * @brief This structure contains the information that needs to be provided to the RPU
 *  when modifying the attributes of a virtual interface.
 *
 */

struct nrf_wifi_umac_chg_vif_attr_info {
	/** Interface type, see &enum nrf_wifi_iftype */
	signed int iftype;
	/** Unused */
	signed int nrf_wifi_use_4addr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to change the interface.
 *
 */

struct nrf_wifi_umac_cmd_chg_vif_attr {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Interface attributes to be changed nrf_wifi_umac_chg_vif_attr_info */
	struct nrf_wifi_umac_chg_vif_attr_info info;
} __NRF_WIFI_PKD;

#define IFACENAMSIZ 16

/**
 * @brief This structure contains the information that needs to be passed to the RPU
 *  when changing the interface state, specifically when bringing it up or down
 *
 */

struct nrf_wifi_umac_chg_vif_state_info {
	/** Interface state (1 = UP / 0 = DOWN) */
	signed int state;
	/** Interface index */
	signed char if_index;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to change the interface state.
 *
 */

struct nrf_wifi_umac_cmd_chg_vif_state {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_chg_vif_state_info */
	struct nrf_wifi_umac_chg_vif_state_info info;
} __NRF_WIFI_PKD;
/**
 * @brief This structure defines an event-to-command mapping for NRF_WIFI_UMAC_CMD_SET_IFFLAGS.
 *
 */

struct nrf_wifi_umac_event_vif_state {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Status to command NRF_WIFI_UMAC_CMD_SET_IFFLAGS */
	signed int status;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to start P2P (Peer-to-Peer) mode on an interface.
 */

struct nrf_wifi_cmd_start_p2p {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command for stopping P2P mode on an interface.
 *
 */

struct nrf_wifi_umac_cmd_stop_p2p_dev {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_FRAME_FREQ_VALID (1 << 0)
#define NRF_WIFI_CMD_FRAME_DURATION_VALID (1 << 1)
#define NRF_WIFI_CMD_SET_FRAME_FREQ_PARAMS_VALID (1 << 2)

#define NRF_WIFI_CMD_FRAME_OFFCHANNEL_TX_OK (1 << 0)
#define NRF_WIFI_CMD_FRAME_TX_NO_CCK_RATE (1 << 1)
#define NRF_WIFI_CMD_FRAME_DONT_WAIT_FOR_ACK (1 << 2)

/**
 * @brief This structure describes the parameters required to transmit a
 *  management frame from the host.
 *
 */

struct nrf_wifi_umac_mgmt_tx_info {
	/** OFFCHANNEL_TX_OK, NO_CCK_RATE, DONT_WAIT_FOR_ACK */
	unsigned int nrf_wifi_flags;
	/** Channel frequency */
	unsigned int frequency;
	/** Duration field value */
	unsigned int dur;
	/** Management frame to transmit, nrf_wifi_frame */
	struct nrf_wifi_frame frame;
	/** Frequency configuration, see &struct freq_params */
	struct freq_params freq_params;
	/** Identifier to be used for processing event,
	 *  NRF_WIFI_UMAC_EVENT_FRAME_TX_STATUS.
	 */
	unsigned long long host_cookie;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to transmit a management frame.
 *
 */

struct nrf_wifi_umac_cmd_mgmt_tx {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Information about the management frame to be transmitted.
	 *  nrf_wifi_umac_mgmt_tx_info
	 */
	struct nrf_wifi_umac_mgmt_tx_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the information regarding the power save state.
 *
 */

struct nrf_wifi_umac_set_power_save_info {
	/** power save is disabled or enabled, see enum nrf_wifi_ps_state */
	signed int ps_state;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command used to enable or disable the power save
 *  functionality.
 *
 */

struct nrf_wifi_umac_cmd_set_power_save {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Power save setting parameters.
	 * nrf_wifi_umac_set_power_save_info
	 */
	struct nrf_wifi_umac_set_power_save_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command to configure power save timeout value.
 *
 */

struct nrf_wifi_umac_cmd_set_power_save_timeout {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Timeout value in milli seconds
	 * if timeout < 0 RPU will set timeout to 100ms
	 */
	signed int timeout;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the information of qos_map.
 *
 */

struct nrf_wifi_umac_qos_map_info {
	/** length of qos_map info field */
	unsigned int qos_map_info_len;
	/** contains qos_map info as received from stack */
	unsigned char qos_map_info[256];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the information related to the Quality of Service (QoS) map.
 *
 */

struct nrf_wifi_umac_cmd_set_qos_map {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** qos map info. nrf_wifi_umac_qos_map_info */
	struct nrf_wifi_umac_qos_map_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to retrieve the transmit power information.
 *
 */

