nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
struct nrf_wifi_umac_cmd_get_tx_power {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to obtain the regulatory domain information.
 *
 */

struct nrf_wifi_umac_cmd_get_reg {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to retrieve channel information.
 *
 */

struct nrf_wifi_umac_cmd_get_channel {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

#define NRF_WIFI_TWT_NEGOTIATION_TYPE_INDIVIDUAL 0
#define NRF_WIFI_TWT_NEGOTIATION_TYPE_BROADCAST 2

/**
 * @brief TWT setup commands and events.
 *
 */

enum nrf_wifi_twt_setup_cmd_type {
	/** STA requests to join a TWT without specifying a target wake time */
	NRF_WIFI_REQUEST_TWT,
	/** STA requests to join a TWT with specifying a target wake time and
	 *  other params, these values can change during negotiation.
	 */
	NRF_WIFI_SUGGEST_TWT,
	/** requests to join a TWT with demanded a target wake time
	 * and other params. STA rejects if AP not scheduling those params.
	 */
	NRF_WIFI_DEMAND_TWT,
	/** Response to the STA request(suggest/demand), these may be different params */
	NRF_WIFI_GROUPING_TWT,
	/** AP accept the STA requested params */
	NRF_WIFI_ACCEPT_TWT,
	/** AP may suggest the params, these may be different from STA requested */
	NRF_WIFI_ALTERNATE_TWT,
	/** AP may suggest the params, these may be different from STA requested */
	NRF_WIFI_DICTATE_TWT,
	/** AP may reject the STA requested params */
	NRF_WIFI_REJECT_TWT,
};

#define NRF_WIFI_TWT_FLOW_TYPE_ANNOUNCED 0
#define NRF_WIFI_TWT_FLOW_TYPE_UNANNOUNCED 1

#define NRF_WIFI_TWT_RESP_RECEIVED 0
#define NRF_WIFI_TWT_RESP_NOT_RECEIVED 1
#define NRF_WIFI_INVALID_TWT_WAKE_INTERVAL 3

/**
 * @brief This structure describes the TWT information.
 *
 */

struct nrf_wifi_umac_config_twt_info {
	/** TWT flow Id */
	unsigned char twt_flow_id;
	/** Negotiation type
	 *  NRF_WIFI_TWT_NEGOTIATION_TYPE_INDIVIDUAL or
	 *  NRF_WIFI_TWT_NEGOTIATION_TYPE_BROADAST
	 */
	unsigned char neg_type;
	/** see &enum nrf_wifi_twt_setup_cmd_type  */
	signed int setup_cmd;
	/** indicating AP to initiate a trigger frame (ps_poll/Null) before data transfer */
	unsigned char ap_trigger_frame;
	/** 1->implicit(same negotiated values to be used),
	 *  0->AP sends new calculated TWT values for every service period.
	 */
	unsigned char is_implicit;
	/** Whether STA has to send the PS-Poll/Null frame
	 *  indicating that it's in wake period(NRF_WIFI_TWT_FLOW_TYPE_ANNOUNCED)
	 */
	unsigned char twt_flow_type;
	/** wake interval exponent value  */
	unsigned char twt_target_wake_interval_exponent;
	/** wake interval mantissa value */
	unsigned short twt_target_wake_interval_mantissa;
	/** start of the waketime value after successful TWT negotiation */
	unsigned long long target_wake_time;
	/** min TWT wake duration */
	unsigned int nominal_min_twt_wake_duration;
	/** dialog_token of twt frame */
	unsigned char dialog_token;
	/** 0->not received 1->received */
	unsigned char twt_resp_status;
	/** TWT early wake duration */
	unsigned int twt_wake_ahead_duration;
	/** Interval between twt request retries */
	unsigned char twt_retry_interval;
	/** TWT request retry count */
	unsigned char twt_retry_count;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the parameters required for setting up TWT session.
 *
 */

struct nrf_wifi_umac_cmd_config_twt {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** TWT configuration info nrf_wifi_umac_config_twt_info */
	struct nrf_wifi_umac_config_twt_info info;
} __NRF_WIFI_PKD;

#define INVALID_TIME 1
#define TRIGGER_NOT_RECEIVED 2

/**
 * @brief This structure represents the TWT delete information.
 *
 */

struct nrf_wifi_umac_teardown_twt_info {
	/** TWT flow Id  */
	unsigned char twt_flow_id;
	/** reason for teardown */
	unsigned char reason_code;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to delete or remove a TWT session
 *
 */

struct nrf_wifi_umac_cmd_teardown_twt {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_teardown_twt_info */
	struct nrf_wifi_umac_teardown_twt_info info;
} __NRF_WIFI_PKD;

#define TWT_BLOCK_TX 0
#define TWT_UNBLOCK_TX 1
/**
 * @brief This structure represents the information related to Tx (transmit) block/unblock.
 *
 */
struct twt_sleep_info {
	/** value for blocking/unblocking TX
	 *  (TWT_BLOCK_TX or TWT_UNBLOCK_TX)
	 */
	unsigned int type;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines an event used to indicate to the host whether to block or
 *  unblock Tx (transmit) packets in TWT communication.
 *
 */

struct nrf_wifi_umac_event_twt_sleep {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** twt_sleep_info */
	struct twt_sleep_info info;
} __NRF_WIFI_PKD;

#define UAPSD_Q_MIN 0
#define UAPSD_Q_MAX 15
/**
 * @brief This structure represents the information about UAPSD queues.
 *
 */

struct nrf_wifi_umac_uapsd_info {
	/** UAPSD-Q value */
	unsigned int uapsd_queue;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure the UAPSD-Q value.
 *
 */

struct nrf_wifi_umac_cmd_config_uapsd {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** nrf_wifi_umac_uapsd_info */
	struct nrf_wifi_umac_uapsd_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the event used to indicate that a scan has started.
 *
 */

struct nrf_wifi_umac_event_trigger_scan {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Scan request control flags (u32). Bit values
	 * (NRF_WIFI_SCAN_FLAG_LOW_PRIORITY/NRF_WIFI_SCAN_FLAG_RANDOM_ADDR...)
	 */
	unsigned int nrf_wifi_scan_flags;
	/** No.of ssids in scan request */
	unsigned char num_scan_ssid;
	/** No.of frequencies in scan request */
	unsigned char num_scan_frequencies;
	/** center frequencies */
	unsigned short scan_frequencies[NRF_WIFI_SCAN_MAX_NUM_FREQUENCIES];
	/** nrf_wifi_ssid */
	struct nrf_wifi_ssid scan_ssid[NRF_WIFI_SCAN_MAX_NUM_SSIDS];
	/** nrf_wifi_ie */
	struct nrf_wifi_ie ie;
} __NRF_WIFI_PKD;

#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_MAC_ADDR_VALID (1 << 0)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_IES_TSF_VALID (1 << 1)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_IES_VALID (1 << 2)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_BEACON_IES_TSF_VALID (1 << 3)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_BEACON_IES_VALID (1 << 4)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_BEACON_INTERVAL_VALID (1 << 5)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_SIGNAL_VALID (1 << 6)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_STATUS_VALID (1 << 7)
#define NRF_WIFI_EVENT_NEW_SCAN_RESULTS_BSS_PRESP_DATA (1 << 8)

#define NRF_WIFI_NEW_SCAN_RESULTS_BSS_PRESP_DATA (1 << 0)

/**
 * @brief This structure serves as a response to the command NRF_WIFI_UMAC_CMD_GET_SCAN_RESULTS.
 *  It contains scan results for each entry. RPU sends multiple events of this type for every
 *  scan entry, and when umac_hdr->seq == 0, it indicates the last scan entry.
 *
 */

struct nrf_wifi_umac_event_new_scan_results {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Unused */
	unsigned int generation;
	/** Frequency in MHz */
	unsigned int frequency;
	/** Channel width of the control channel */
	unsigned int chan_width;
	/** Age of this BSS entry in ms */
	unsigned int seen_ms_ago;
	/** Unused */
	unsigned int nrf_wifi_flags;
	/** Status, if this BSS is "used" */
	signed int status;
	/** TSF of the received probe response/beacon (u64) */
	unsigned long long ies_tsf;
	/** TSF of the last received beacon
	 *  (not present if no beacon frame has been received yet).
	 */
	unsigned long long beacon_ies_tsf;
	/** Beacon interval of BSS */
	unsigned short beacon_interval;
	/** Capability field */
	unsigned short capability;
	/** Signal strength, nrf_wifi_signal */
	struct nrf_wifi_signal signal;
	/** BSSID of the BSS (6 octets) */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Indicates length of IE's present at the starting of ies[0] */
	unsigned int ies_len;
	/** Indicates length of beacon_ies present after ies+ies_len */
	unsigned int beacon_ies_len;
	/** contains raw information elements from the probe response/beacon.
	 * If beacon_ies are not present then the IEs here are from a Probe Response
	 * frame; otherwise they are from a Beacon frame.
	 */
	unsigned char ies[0];
} __NRF_WIFI_PKD;

#define NRF_WIFI_802_11A (1 << 0)
#define NRF_WIFI_802_11B (1 << 1)
#define NRF_WIFI_802_11G (1 << 2)
#define NRF_WIFI_802_11N (1 << 3)
#define NRF_WIFI_802_11AC (1 << 4)
#define NRF_WIFI_802_11AX (1 << 5)

#define NRF_WIFI_MFP_REQUIRED (1 << 0)
#define NRF_WIFI_MFP_CAPABLE  (1 << 1)

#define NRF_WIFI_PASN_SUPPORT (1 << 0)
#define NRF_WIFI_FTM_SUPPORT (1 << 1)
#define NRF_WIFI_SENSING_SUPPORT (1 << 2)
#define NRF_WIFI_RANGING_TB (1 << 3)
#define NRF_WIFI_RANGING_NON_TB (1 << 4)
#define NRF_WIFI_RANGING_SECURITY (1 << 5)

/**
 * @brief This structure represents the response for NRF_WIFI_UMAC_CMD_GET_SCAN_RESULTS.
 *  It contains the displayed scan result.
 *
 */

struct umac_display_results {
	/** Network SSID nrf_wifi_ssid */
	struct nrf_wifi_ssid ssid;
	/** BSSID of the BSS (6 octets) */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Network band of operation, refer &enum nrf_wifi_band */
	signed int nwk_band;
	/** Network channel number */
	unsigned int nwk_channel;
	/**  Protocol type (NRF_WIFI_802_11A) */
	unsigned char protocol_flags;
	/** Network security mode, refer &enum nrf_wifi_security_type */
	signed int security_type;
	/** Beacon interval of the BSS */
	unsigned short beacon_interval;
	/** Capability field */
	unsigned short capability;
	/** Signal strength. Refer &struct nrf_wifi_signal */
	struct nrf_wifi_signal signal;
	/** TWT support */
	unsigned char twt_support;
	/** management frame protection NRF_WIFI_MFP_REQUIRED/NRF_WIFI_MFP_CAPABLE */
	unsigned char mfp_flag;
	unsigned char msmr_capabilities;
	/** FTM capabilities */
	unsigned char ftm_capabilities;
	/** reserved */
	unsigned char reserved4;
} __NRF_WIFI_PKD;

#define DISPLAY_BSS_TOHOST_PEREVNT 8

