nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_EVENT_MLME_FRAME_VALID (1 << 0)
#define NRF_WIFI_EVENT_MLME_MAC_ADDR_VALID (1 << 1)
#define NRF_WIFI_EVENT_MLME_FREQ_VALID (1 << 2)
#define NRF_WIFI_EVENT_MLME_COOKIE_VALID (1 << 3)
#define NRF_WIFI_EVENT_MLME_RX_SIGNAL_DBM_VALID (1 << 4)
#define NRF_WIFI_EVENT_MLME_WME_UAPSD_QUEUES_VALID (1 << 5)
#define NRF_WIFI_EVENT_MLME_RXMGMT_FLAGS_VALID (1 << 6)
#define NRF_WIFI_EVENT_MLME_IE_VALID   (1 << 7)
#define NRF_WIFI_EVENT_MLME_RXDEAUTH_FROM_AP   (1 << 8)

#define NRF_WIFI_EVENT_MLME_TIMED_OUT (1 << 0)
#define NRF_WIFI_EVENT_MLME_ACK (1 << 1)

/**
 * @brief This structure represent different responses received from the access point during
 *  various stages of the connection process like Authentication Response and Association Response.
 *
 */

struct nrf_wifi_umac_event_mlme {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Frequency of the channel in MHz */
	unsigned int frequency;
	/** Signal strength in dBm */
	unsigned int rx_signal_dbm;
	/** Indicate whether the frame was acked or timed out */
	unsigned int nrf_wifi_flags;
	/** cookie identifier */
	unsigned long long cookie;
	/** Frame data, including frame header and body nrf_wifi_frame */
	struct nrf_wifi_frame frame;
	/** BSSID of the BSS */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Bitmap of uapsd queues */
	unsigned char wme_uapsd_queues;
	/** Request(AUTH/ASSOC) ie length */
	unsigned int req_ie_len;
	/** ie's */
	unsigned char req_ie[0];
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_SEND_STATION_ASSOC_REQ_IES_VALID (1 << 0)

/**
 * @brief This structure represents an event that is generated when a station is added or removed.
 *
 */

struct nrf_wifi_umac_event_new_station {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate if assoc_req ies is valid */
	unsigned int valid_fields;
	/** set to 1: STA supports QoS/WME */
	unsigned char wme;
	/** Set to 1 if STA is Legacy(a/b/g) */
	unsigned char is_sta_legacy;
	/** Station mac address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** generation number */
	unsigned int generation;
	/** Station information nrf_wifi_sta_info */
	struct nrf_wifi_sta_info sta_info;
	/** nrf_wifi_ie */
	struct nrf_wifi_ie assoc_req_ies;

} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_COOKIE_RSP_COOKIE_VALID (1 << 0)
#define NRF_WIFI_CMD_COOKIE_RSP_MAC_ADDR_VALID (1 << 1)

/**
 * @brief This structure specifies the cookie response event, which is used to receive an
 *  RPU cookie associated with the host cookie passed during NRF_WIFI_UMAC_CMD_FRAME.
 *
 */

struct nrf_wifi_umac_event_cookie_rsp {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate if assoc_req ies is valid */
	unsigned int valid_fields;
	/** Identifier passed during NRF_WIFI_UMAC_CMD_FRAME */
	unsigned long long host_cookie;
	/** Cookie used to indicate TX done in NRF_WIFI_UMAC_EVENT_FRAME_TX_STATUS */
	unsigned long long cookie;
	/** Mac address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];

} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the event that corresponds to the command
 *  NRF_WIFI_UMAC_CMD_GET_TX_POWER. It is used to retrieve the transmit power
 *  information from the device
 *
 */

struct nrf_wifi_umac_event_get_tx_power {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Tx power in dbm */
	signed int txpwr_level;

} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the response to the command NRF_WIFI_UMAC_CMD_SET_INTERFACE.
 *  It contains the necessary information indicating the result or status of the interface
 *  configuration operation after the command has been executed.
 *
 */

struct nrf_wifi_umac_event_set_interface {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** return value */
	signed int return_value;
} __NRF_WIFI_PKD;

/**
 * @brief channel flags.
 *
 * Channel flags set by the regulatory control code.
 *
 */

enum nrf_wifi_channel_flags {
	/** This channel is disabled */
	CHAN_DISABLED     = 1<<0,
	/** do not initiate radiation, this includes sending probe requests or beaconing */
	CHAN_NO_IR        = 1<<1,
	/** Radar detection is required on this channel hole at 1<<2 */
	CHAN_RADAR        = 1<<3,
	/** extension channel above this channel is not permitted */
	CHAN_NO_HT40PLUS  = 1<<4,
	/** extension channel below this channel is not permitted */
	CHAN_NO_HT40MINUS = 1<<5,
	/** OFDM is not allowed on this channel */
	CHAN_NO_OFDM      = 1<<6,
	/** If the driver supports 80 MHz on the band,
	 * this flag indicates that an 80 MHz channel cannot use this
	 * channel as the control or any of the secondary channels.
	 * This may be due to the driver or due to regulatory bandwidth
	 * restrictions.
	 */
	CHAN_NO_80MHZ     = 1<<7,
	/** If the driver supports 160 MHz on the band,
	 * this flag indicates that an 160 MHz channel cannot use this
	 * channel as the control or any of the secondary channels.
	 * This may be due to the driver or due to regulatory bandwidth
	 * restrictions.
	 */
	CHAN_NO_160MHZ    = 1<<8,
	/** NL80211_FREQUENCY_ATTR_INDOOR_ONLY */
	CHAN_INDOOR_ONLY  = 1<<9,
	/** NL80211_FREQUENCY_ATTR_GO_CONCURRENT */
	CHAN_GO_CONCURRENT    = 1<<10,
	/** 20 MHz bandwidth is not permitted on this channel */
	CHAN_NO_20MHZ     = 1<<11,
	/** 10 MHz bandwidth is not permitted on this channel */
	CHAN_NO_10MHZ     = 1<<12,
};

/**
 * @brief channel definition.
 *
 */

struct nrf_wifi_chan_definition {
	/** Frequency of the selected channel in MHz */
	struct nrf_wifi_channel chan;
	/** channel width */
	signed int width;
	/** center frequency of first segment */
	unsigned int center_frequency1;
	/** center frequency of second segment (only with 80+80 MHz) */
	unsigned int center_frequency2;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents channel information and serves as the event for the
 *  command NRF_WIFI_UMAC_CMD_GET_CHANNEL.
 *
 */
struct nrf_wifi_umac_event_get_channel {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Channel information.nrf_wifi_chan_definition */
	struct nrf_wifi_chan_definition chan_def;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command used to retrieve connection information.
 *
 */
struct nrf_wifi_umac_cmd_conn_info {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

enum link_mode {
	NRF_WIFI_MODE_11B = 1,
	NRF_WIFI_MODE_11A,
	NRF_WIFI_MODE_11G,
	NRF_WIFI_MODE_11N,
	NRF_WIFI_MODE_11AC,
	NRF_WIFI_MODE_11AX,
	NRF_WIFI_MODE_11BE
};

/**
 * @brief This structure represents the information related to the connection of a station.
 *
 */

struct nrf_wifi_umac_event_conn_info {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Beacon interval */
	unsigned short beacon_interval;
	/** DTIM interval */
	unsigned char dtim_interval;
	/** Station association state */
	unsigned char associated;
	/** TWT supported or not */
	unsigned char twt_capable;
	/** Refer &enum link_mode */
	unsigned char linkmode;
} __NRF_WIFI_PKD;


/**
 * @brief This structure defines the command used to retrieve power save information.
 *
 */
struct nrf_wifi_umac_cmd_get_power_save_info {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to set the listen interval period.
 *  It determines how frequently a device wakes up to check for any pending data or traffic
 *  from the access point. By setting the listen interval, devices can adjust their power-saving
 *  behavior to balance power efficiency and responsiveness to incoming data.
 *
 */
struct nrf_wifi_umac_cmd_set_listen_interval {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** listen interval */
	unsigned short listen_interval;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command used to enable or disable extended power save mode.
 *  When enabled, the RPU wakes up based on the listen interval, allowing the device to spend more
 *  time in a lower power state. When disabled, the RPU wakes up based on the DTIM period, which
 *  may require more frequent wake-ups but can provide better responsiveness for receiving
 *  multicast/broadcast traffic.
 *
 */
struct nrf_wifi_umac_cmd_config_extended_ps {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** 1=enable 0=disable */
	unsigned char enable_extended_ps;
} __NRF_WIFI_PKD;

