nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_MAX_TWT_FLOWS 8
#define NRF_WIFI_PS_MODE_LEGACY 0
#define NRF_WIFI_PS_MODE_WMM 1

/**
 * @brief Given that most APs typically use a DTIM value of 3,
 *  we anticipate a minimum listen interval of 3 beacon intervals.
 *
 */
#define NRF_WIFI_LISTEN_INTERVAL_MIN 3

/**
 * @brief This structure represents an event that provides information about the RPU power save
 *  mode. It contains details regarding the current power save mode and its settings.
 *
 */
struct nrf_wifi_umac_event_power_save_info {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Power save mode. NRF_WIFI_PS_MODE_LEGACY/NRF_WIFI_PS_MODE_WMM */
	unsigned char ps_mode;
	/** Power save enable flag */
	unsigned char enabled;
	/** Extended power save ON(1)/OFF(0) */
	unsigned char extended_ps;
	/** Is TWT responder */
	unsigned char twt_responder;
	/** Power save timed out value */
	unsigned int ps_timeout;
	/** Listen interval value */
	unsigned short listen_interval;
	/** Power save exit strategy */
	unsigned char ps_exit_strategy;
	/** Number TWT flows */
	unsigned char num_twt_flows;
	/** TWT info of each flow nrf_wifi_umac_config_twt_info */
	struct nrf_wifi_umac_config_twt_info twt_flow_info[0];
} __NRF_WIFI_PKD;

#define NRF_WIFI_EVENT_TRIGGER_SCAN_IE_VALID (1 << 0)
#define NRF_WIFI_EVENT_TRIGGER_SCAN_SCAN_FLAGS_VALID (1 << 1)
/**
 * @brief This structure contains information relevant to the "Remain on Channel" operation.
 *  It is used to specify the details related to the duration and channel on which a device
 *  needs to stay without regular data transmission or reception.
 *
 */

struct remain_on_channel_info {
	/** Amount of time to remain on specified channel */
	unsigned int dur;
	/** Frequency configuration, see &struct freq_params */
	struct freq_params nrf_wifi_freq_params;
	/** Identifier to be used for processing NRF_WIFI_UMAC_EVENT_COOKIE_RESP event */
	unsigned long long host_cookie;
	/** Unused */
	unsigned long long cookie;

} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_ROC_FREQ_PARAMS_VALID (1 << 0)
#define NRF_WIFI_CMD_ROC_DURATION_VALID (1 << 1)
/**
 * @brief This structure represents the command used to keep the device awake on the specified
 *  channel for a designated period. The command initiates the "Remain on Channel" operation.
 *
 */

struct nrf_wifi_umac_cmd_remain_on_channel {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Information about channel parameters.remain_on_channel_info */
	struct remain_on_channel_info info;

} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_CANCEL_ROC_COOKIE_VALID (1 << 0)
/**
 * @brief This structure represents the command to cancel "Remain on Channel" operation.
 *
 */
struct nrf_wifi_umac_cmd_cancel_remain_on_channel {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** cookie to identify remain on channel */
	unsigned long long cookie;
} __NRF_WIFI_PKD;

#define NRF_WIFI_EVENT_ROC_FREQ_VALID (1 << 0)
#define NRF_WIFI_EVENT_ROC_COOKIE_VALID (1 << 1)
#define NRF_WIFI_EVENT_ROC_DURATION_VALID (1 << 2)
#define NRF_WIFI_EVENT_ROC_CH_TYPE_VALID (1 << 3)
/**
 * @brief This structure represents the response to command "Remain on Channel".
 *
 */

struct nrf_wifi_event_remain_on_channel {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Frequency of the channel */
	unsigned int frequency;
	/** duration that can be requested with the remain-on-channel operation(ms) */
	unsigned int dur;
	/** see &enum nrf_wifi_channel_type */
	unsigned int ch_type;
	/** cookie to identify remain on channel */
	unsigned long long cookie;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to retrieve interface information.
 *
 */
struct nrf_wifi_cmd_get_interface {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

#define NRF_WIFI_INTERFACE_INFO_CHAN_DEF_VALID (1 << 0)
#define NRF_WIFI_INTERFACE_INFO_SSID_VALID (1 << 1)
#define NRF_WIFI_INTERFACE_INFO_IFNAME_VALID (1 << 2)

/**
 * @brief This structure represents an event that contains information about a network interface.
 *
 */

struct nrf_wifi_interface_info {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Interface type, see &enum nrf_wifi_iftype */
	signed int nrf_wifi_iftype;
	/** Interface name */
	signed char ifacename[IFACENAMSIZ];
	/** Mac address */
	unsigned char nrf_wifi_eth_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** nrf_wifi_chan_definition */
	struct nrf_wifi_chan_definition chan_def;
	/** nrf_wifi_ssid */
	struct nrf_wifi_ssid ssid;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents HT capability parameters.
 *
 */
struct nrf_wifi_event_sta_ht_cap {
	/** 1 indicates HT Supported */
	signed int nrf_wifi_ht_supported;
	/** HT capabilities, as in the HT information IE */
	unsigned short nrf_wifi_cap;
	/** MCS information. nrf_wifi_event_mcs_info */
	struct nrf_wifi_event_mcs_info mcs;
	/** A-MPDU factor, as in 11n */
	unsigned char nrf_wifi_ampdu_factor;
	/** A-MPDU density, as in 11n */
	unsigned char nrf_wifi_ampdu_density;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_IR (1 << 0)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_IBSS (1 << 1)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_RADAR (1 << 2)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_HT40_MINUS (1 << 3)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_HT40_PLUS (1 << 4)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_80MHZ (1 << 5)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_160MHZ (1 << 6)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_INDOOR_ONLY (1 << 7)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_GO_CONCURRENT (1 << 8)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_20MHZ (1 << 9)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_10MHZ (1 << 10)
#define NRF_WIFI_CHAN_FLAG_FREQUENCY_DISABLED (1 << 11)

