nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_CHAN_DFS_VALID (1 << 12)
#define NRF_WIFI_CHAN_DFS_CAC_TIME_VALID (1 << 13)

/**
 * @brief This structure represents channel parameters.
 */
struct nrf_wifi_event_channel {
	/** channel flags NRF_WIFI_CHAN_FLAG_FREQUENCY_ATTR_NO_IBSS */
	unsigned short nrf_wifi_flags;
	/** maximum transmission power (in dBm) */
	signed int nrf_wifi_max_power;
	/** DFS state time */
	unsigned int nrf_wifi_time;
	/** DFS CAC time in ms */
	unsigned int dfs_cac_msec;
	/** Channel parameters are valid or not 1=valid */
	signed char ch_valid;
	/** Channel center frequency */
	unsigned short center_frequency;
	/** Current dfs state */
	signed char dfs_state;
} __NRF_WIFI_PKD;

#define NRF_WIFI_EVENT_GET_WIPHY_FLAG_RATE_SHORT_PREAMBLE (1 << 0)
/**
 * @brief This structure represents rate information.
 */
struct nrf_wifi_event_rate {
	/** NRF_WIFI_EVENT_GET_WIPHY_FLAG_RATE_SHORT_PREAMBLE */
	unsigned short nrf_wifi_flags;
	/** Bitrate in units of 100 kbps */
	unsigned short nrf_wifi_bitrate;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents VHT capability parameters.
 *
 */
struct nrf_wifi_event_sta_vht_cap {
	/** 1 indicates VHT Supported */
	signed char nrf_wifi_vht_supported;
	/** VHT capability info */
	unsigned int nrf_wifi_cap;
	/** Refer nrf_wifi_event_vht_mcs_info */
	struct nrf_wifi_event_vht_mcs_info vht_mcs;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents HE capabilities information.
 *
 */

struct nrf_wifi_event_sta_he_cap {
	/** 1 indicates HE Supported */
	signed char nrf_wifi_he_supported;
	/** HE capabilities information */
	struct nrf_wifi_he_cap_elem he_cap_elem;
} __NRF_WIFI_PKD;

/**
 * @brief Frequency band information.
 *
 */
struct nrf_wifi_event_supported_band {
	/** No.of channels */
	unsigned short nrf_wifi_n_channels;
	/** No.of bitrates */
	unsigned short nrf_wifi_n_bitrates;
	/** Array of channels the hardware can operate in this band */
	struct nrf_wifi_event_channel channels[29];
	/** Array of bitrates the hardware can operate with in this band */
	struct nrf_wifi_event_rate bitrates[13];
	/** HT capabilities in this band */
	struct nrf_wifi_event_sta_ht_cap ht_cap;
	/** VHT capabilities in this band */
	struct nrf_wifi_event_sta_vht_cap vht_cap;
	/** HE capabilities in this band */
	struct nrf_wifi_event_sta_he_cap he_cap;
	/** 6Ghz HE capabilities in this band */
	struct nrf_wifi_event_sta_he_6ghz_cap he_6ghz_cap;
	/** the band this structure represents */
	signed char band;
} __NRF_WIFI_PKD;

/**
 * @brief Interface limits.
 *
 */
struct nrf_wifi_event_iface_limit {
	/** max interface limits */
	unsigned short nrf_wifi_max;
	/** types */
	unsigned short nrf_wifi_types;
} __NRF_WIFI_PKD;


#define NRF_WIFI_EVENT_GET_WIPHY_VALID_RADAR_DETECT_WIDTHS (1 << 0)
#define NRF_WIFI_EVENT_GET_WIPHY_VALID_RADAR_DETECT_REGIONS (1 << 1)
#define NRF_WIFI_EVENT_GET_WIPHY_VALID_ (1 << 2)
/**
 * @brief This structure defines an event that represents interface combinations.
 *
 */
struct nrf_wifi_event_iface_combination {
	/** channels count */
	unsigned int nrf_wifi_num_different_channels;
	/** Unused */
	signed int beacon_int_infra_match;
	/** nrf_wifi_event_iface_limit */
	struct nrf_wifi_event_iface_limit limits[2];
	/** Max interfaces */
	unsigned short nrf_wifi_max_interfaces;
	/** Not used */
	unsigned char nrf_wifi_radar_detect_widths;
	/** Not used */
	unsigned char nrf_wifi_n_limits;
	/** Not used */
	unsigned char nrf_wifi_radar_detect_regions;
	/** Not used */
	unsigned char comb_valid;
} __NRF_WIFI_PKD;

#define NRF_WIFI_EVENT_GET_WIPHY_IBSS_RSN (1 << 0)
#define NRF_WIFI_EVENT_GET_WIPHY_MESH_AUTH (1 << 1)
#define NRF_WIFI_EVENT_GET_WIPHY_AP_UAPSD (1 << 2)
#define NRF_WIFI_EVENT_GET_WIPHY_SUPPORTS_FW_ROAM (1 << 3)
#define NRF_WIFI_EVENT_GET_WIPHY_SUPPORTS_TDLS (1 << 4)
#define NRF_WIFI_EVENT_GET_WIPHY_TDLS_EXTERNAL_SETUP (1 << 5)
#define NRF_WIFI_EVENT_GET_WIPHY_CONTROL_PORT_ETHERTYPE (1 << 6)
#define NRF_WIFI_EVENT_GET_WIPHY_OFFCHANNEL_TX_OK (1 << 7)

#define NRF_WIFI_GET_WIPHY_VALID_PROBE_RESP_OFFLOAD (1 << 0)
#define NRF_WIFI_GET_WIPHY_VALID_TX_ANT (1 << 1)
#define NRF_WIFI_GET_WIPHY_VALID_RX_ANT (1 << 2)
#define NRF_WIFI_GET_WIPHY_VALID_MAX_NUM_SCAN_SSIDS (1 << 3)
#define NRF_WIFI_GET_WIPHY_VALID_NUM_SCHED_SCAN_SSIDS (1 << 4)
#define NRF_WIFI_GET_WIPHY_VALID_MAX_MATCH_SETS (1 << 5)
#define NRF_WIFI_GET_WIPHY_VALID_MAC_ACL_MAX (1 << 6)
#define NRF_WIFI_GET_WIPHY_VALID_HAVE_AP_SME (1 << 7)
#define NRF_WIFI_GET_WIPHY_VALID_EXTENDED_CAPABILITIES (1 << 8)
#define NRF_WIFI_GET_WIPHY_VALID_MAX_AP_ASSOC_STA (1 << 9)
#define NRF_WIFI_GET_WIPHY_VALID_WIPHY_NAME (1 << 10)
#define NRF_WIFI_GET_WIPHY_VALID_EXTENDED_FEATURES (1 << 11)

#define NRF_WIFI_EVENT_GET_WIPHY_MAX_CIPHER_COUNT 30

#define NRF_WIFI_INDEX_IDS_WIPHY_NAME 32
#define NRF_WIFI_EVENT_GET_WIPHY_NUM_BANDS 4

#define EXTENDED_FEATURE_LEN 69
#define DIV_ROUND_UP_NL(n, d) (((n) + (d)-1) / (d))

/**
 * @brief This structure represents wiphy parameters.
 *
 */
struct nrf_wifi_event_get_wiphy {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Unused */
	unsigned int nrf_wifi_frag_threshold;
	/** RTS threshold value */
	unsigned int nrf_wifi_rts_threshold;
	/** Unused */
	unsigned int nrf_wifi_available_antennas_tx;
	/** Unused */
	unsigned int nrf_wifi_available_antennas_rx;
	/** Unused */
	unsigned int nrf_wifi_probe_resp_offload;
	/** Unused */
	unsigned int tx_ant;
	/** Unused */
	unsigned int rx_ant;
	/** Unused */
	unsigned int split_start2_flags;
	/** Maximum ROC duration */
	unsigned int max_remain_on_channel_duration;
	/** Unused */
	unsigned int ap_sme_capa;
	/** Unused */
	unsigned int features;
	/** Unused */
	unsigned int max_acl_mac_addresses;
	/** maximum number of associated stations supported in AP mode */
	unsigned int max_ap_assoc_sta;
	/** supported cipher suites */
	unsigned int cipher_suites[NRF_WIFI_EVENT_GET_WIPHY_MAX_CIPHER_COUNT];
	/** wiphy flags NRF_WIFI_EVENT_GET_WIPHY_AP_UAPSD */
	unsigned int get_wiphy_flags;
	/** valid parameters NRF_WIFI_GET_WIPHY_VALID_WIPHY_NAME */
	unsigned int params_valid;
	/** Maximum scan IE length */
	unsigned short int max_scan_ie_len;
	/** Unused */
	unsigned short int max_sched_scan_ie_len;
	/** bit mask of interface value of see &enum nrf_wifi_iftype */
	unsigned short int interface_modes;
	/** Unused */
	struct nrf_wifi_event_iface_combination iface_com[6];
	/** Unused */
	signed char supp_commands[40];
	/** Retry limit for short frames */
	unsigned char retry_short;
	/** Retry limit for long frames */
	unsigned char retry_long;
	/** Unused */
	unsigned char coverage_class;
	/** Maximum ssids supported in scan */
	unsigned char max_scan_ssids;
	/** Unused */
	unsigned char max_sched_scan_ssids;
	/** Unused */
	unsigned char max_match_sets;
	/** Unused */
	unsigned char n_cipher_suites;
	/** Unused */
	unsigned char max_num_pmkids;
	/** length of the extended capabilities */
	unsigned char extended_capabilities_len;
	/** Extended capabilities */
	unsigned char extended_capabilities[10];
	/** Extended capabilities mask */
	unsigned char extended_capabilities_mask[10];
	/** Unused */
	unsigned char ext_features[DIV_ROUND_UP_NL(EXTENDED_FEATURE_LEN, 8)];
	/** Unused */
	unsigned char ext_features_len;
	/** Unused */
	signed char num_iface_com;
	/** Wiphy name */
	signed char wiphy_name[NRF_WIFI_INDEX_IDS_WIPHY_NAME];
	/** Supported bands info. nrf_wifi_event_supported_band */
	struct nrf_wifi_event_supported_band sband[NRF_WIFI_EVENT_GET_WIPHY_NUM_BANDS];
} __NRF_WIFI_PKD;
/**
 * @brief This structure represents the command used to retrieve Wireless PHY (wiphy) information.
 *
 */
struct nrf_wifi_cmd_get_wiphy {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command to get hardware address.
 *
 */
struct nrf_wifi_cmd_get_ifhwaddr {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Interface name */
	signed char ifacename[IFACENAMSIZ];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command used to retrieve the hardware address or
 *  MAC address of the device.
 *
 */
struct nrf_wifi_cmd_set_ifhwaddr {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Interface name */
	signed char ifacename[IFACENAMSIZ];
	/** Hardware address to be set */
	unsigned char nrf_wifi_hwaddr[NRF_WIFI_ETH_ADDR_LEN];
} __NRF_WIFI_PKD;

#define REG_RULE_FLAGS_VALID (1 << 0)
#define FREQ_RANGE_START_VALID (1 << 1)
#define FREQ_RANGE_END_VALID (1 << 2)
#define FREQ_RANGE_MAX_BW_VALID (1 << 3)
#define POWER_RULE_MAX_EIRP_VALID (1 << 4)

#define NRF_WIFI_RULE_FLAGS_NO_OFDM (1<<0)
#define NRF_WIFI_RULE_FLAGS_NO_CCK (1<<1)
#define NRF_WIFI_RULE_FLAGS_NO_INDOOR (1<<2)
#define NRF_WIFI_RULE_FLAGS_NO_OUTDOOR (1<<3)
#define NRF_WIFI_RULE_FLAGS_DFS (1<<4)
#define NRF_WIFI_RULE_FLAGS_PTP_ONLY  (1<<5)
#define NRF_WIFI_RULE_FLAGS_PTMP_ONLY (1<<6)
#define NRF_WIFI_RULE_FLAGS_NO_IR (1<<7)
#define NRF_WIFI_RULE_FLAGS_IBSS (1<<8)
#define NRF_WIFI_RULE_FLAGS_AUTO_BW (1<<11)
#define NRF_WIFI_RULE_FLAGS_IR_CONCURRENT (1<<12)
#define NRF_WIFI_RULE_FLAGS_NO_HT40MINUS (1<<13)
#define NRF_WIFI_RULE_FLAGS_NO_HT40PLUS (1<<14)
#define NRF_WIFI_RULE_FLAGS_NO_80MHZ (1<<15)
#define NRF_WIFI_RULE_FLAGS_NO_160MHZ (1<<16)

/**
 * @brief This structure represents the information related to the regulatory domain
 *  of a wireless device. The regulatory domain defines the specific rules and regulations
 *  that govern the usage of radio frequencies in a particular geographical region.
 *
 */

struct nrf_wifi_reg_rules {
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** NRF_WIFI_RULE_FLAGS_NO_CCK and NRF_WIFI_RULE_FLAGS_NO_INDOOR */
	unsigned int rule_flags;
	/** starting frequencry for the regulatory rule in KHz */
	unsigned int freq_range_start;
	/** ending frequency for the regulatory rule in KHz */
	unsigned int freq_range_end;
	/** maximum allowed bandwidth for this frequency range */
	unsigned int freq_range_max_bw;
	/** maximum allowed EIRP mBm (100 * dBm) */
	unsigned int pwr_max_eirp;

} __NRF_WIFI_PKD;

/**
 * @brief This structure represents channels information like maximum power,
 *  center frequency, channel supported and active or passive scan.
 *
 */
struct nrf_wifi_get_reg_chn_info {
	/** center frequency in MHz */
	unsigned int center_frequency;
	/** maximum transmission power (in dBm) */
	unsigned int max_power;
	/** Particular channel is supported or not */
	char supported;
	/** Particular channel is supports passive scanning or not */
	char passive_channel;
	/** Particular channel is dfs or not */
	char dfs;
} __NRF_WIFI_PKD;

#define NRF_WIFI_CMD_SET_REG_ALPHA2_VALID (1 << 0)
#define NRF_WIFI_CMD_SET_REG_RULES_VALID (1 << 1)
#define NRF_WIFI_CMD_SET_REG_DFS_REGION_VALID (1 << 2)

#define MAX_NUM_REG_RULES 32

/**
 * @brief This structure represents an event that contains regulatory domain information.
 *
 */

struct nrf_wifi_reg {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Country code */
	unsigned char nrf_wifi_alpha2[NRF_WIFI_COUNTRY_CODE_LEN];
	/** Number of channel list information */
	unsigned int num_channels;
	/** channels list information */
	struct nrf_wifi_get_reg_chn_info chn_info[0];
} __NRF_WIFI_PKD;

