nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_CMD_REQ_SET_REG_ALPHA2_VALID (1 << 0)
#define NRF_WIFI_CMD_REQ_SET_REG_USER_REG_HINT_TYPE_VALID (1 << 1)
#define NRF_WIFI_CMD_REQ_SET_REG_USER_REG_FORCE (1 << 2)
/**
 * @brief This structure represents the command used to set the regulatory domain
 *  for a wireless device. It allows configuring the device to adhere to the rules
 *  and regulations specific to the geographical region in which it is operating.
 *
 */
struct nrf_wifi_cmd_req_set_reg {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Indicate which of the following parameters are valid */
	unsigned int valid_fields;
	/** Type of regulatory hint passed from userspace */
	unsigned int nrf_wifi_user_reg_hint_type;
	/** Country code */
	unsigned char nrf_wifi_alpha2[NRF_WIFI_COUNTRY_CODE_LEN];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the status code for a command. It is used to indicate
 *  the outcome or result of executing a specific command. The status code provides valuable
 *  information about the success, failure, or any errors encountered during the execution
 *  of the command, helping to understand the current state of the device.
 *
 */
struct nrf_wifi_umac_event_cmd_status {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Command id. see &enum nrf_wifi_umac_commands */
	unsigned int cmd_id;
	/** Status codes */
	unsigned int cmd_status;
	/** Internal error code */
	unsigned int rpu_error_code;
} __NRF_WIFI_PKD;


 /**
  * @brief This structure represents the command used to  configure quiet period.
  *
  */
struct nrf_wifi_umac_cmd_config_quiet_period {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** quiet period value in seconds */
	unsigned int quiet_period_in_sec;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure the power save exit
 * strategy for retrieving buffered data from the AP in power save mode.
 *
 */
struct nrf_wifi_cmd_ps_exit_strategy {
	/** Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Power save exit strategy */
	unsigned char ps_exit_strategy;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the information related to rx buffers.
 *
 */

struct nrf_wifi_rx_buf {
	/** pointer to the rx buffer */
	unsigned int skb_pointer;
	/** Descriptor value */
	unsigned short skb_desc_no;
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the command used to configure RX buffers.
 *
 */

struct nrf_wifi_cmd_rx_buf_info {
	/** Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** number of rx buffers */
	unsigned int rx_buf_num;
	/** @ref nrf_wifi_rx_buf */
	struct nrf_wifi_rx_buf info[0];
} __NRF_WIFI_PKD;

/**
 * @brief Set channel configuration.
 *
 * This structure represents the command to set the wireless channel configuration.
 */
struct nrf_wifi_umac_cmd_set_channel {
	/** UMAC command header. Refer &struct nrf_wifi_umac_hdr. */
	struct nrf_wifi_umac_hdr umac_hdr;
#define NRF_WIFI_CMD_SET_CHANNEL_FREQ_PARAMS_VALID (1 << 0)
	/** Indicate which of the following structure parameters are valid. */
	unsigned int valid_fields;
	/** Information related to channel parameters */
	struct freq_params freq_params;
} __NRF_WIFI_PKD;

struct nrf_wifi_event_send_beacon_hint {
	struct nrf_wifi_umac_hdr umac_hdr;
	struct nrf_wifi_event_channel channel_before;
	struct nrf_wifi_event_channel channel_after;

} __NRF_WIFI_PKD;
/**
 * @brief This structure represents the event that is generated when the regulatory domain
 * is modified or updated. It contains the new regulatory domain information.
 *
 */
struct nrf_wifi_event_regulatory_change {
	struct nrf_wifi_umac_hdr umac_hdr;
	unsigned short nrf_wifi_flags;
	signed int intr;
	signed char regulatory_type;
	unsigned char nrf_wifi_alpha2[2];
} __NRF_WIFI_PKD;


struct nrf_wifi_cmd_get_ifindex {
	struct nrf_wifi_umac_hdr umac_hdr;
	signed char ifacename[IFACENAMSIZ];
} __NRF_WIFI_PKD;

#define TX_BUF_HEADROOM 52

/**
 * @brief UMAC data interface commands and events.
 *
 */
enum nrf_wifi_umac_data_commands {
	/** Unused. */
	NRF_WIFI_CMD_MGMT_BUFF_CONFIG,
	/** Transmit data packet @ref nrf_wifi_tx_buff */
	NRF_WIFI_CMD_TX_BUFF,
	/** TX done event @ref nrf_wifi_tx_buff_done */
	NRF_WIFI_CMD_TX_BUFF_DONE,
	/** RX packet event @ref nrf_wifi_rx_buff*/
	NRF_WIFI_CMD_RX_BUFF,
	/** Event to indicate interface is operational
	 *  @ref nrf_wifi_data_carrier_state
	 */
	NRF_WIFI_CMD_CARRIER_ON,
	/** Event to indicate interface is non-operational
	 *  @ref nrf_wifi_data_carrier_state
	 */
	NRF_WIFI_CMD_CARRIER_OFF,
	/** Event to indicate softap client's power save mode
	 *  If client is in power save mode, host should start buffering
	 *  packets until it receives NRF_WIFI_CMD_PS_GET_FRAMES event.
	 */
	NRF_WIFI_CMD_PM_MODE,
	/** Event to indicate to start sending buffered packets for
	 *  softap client @ref nrf_wifi_sap_ps_get_frames.
	 */
	NRF_WIFI_CMD_PS_GET_FRAMES,
};

/**
 * @brief Data interface Command and Event header.
 *
 */
struct nrf_wifi_umac_head {
	/** Command or Event id see &enum nrf_wifi_umac_data_commands */
	unsigned int cmd;
	/** length */
	unsigned int len;

} __NRF_WIFI_PKD;

#define NRF_WIFI_TX_FLAGS_DSCP_TOS_MASK  0xFFFF
#define NRF_WIFI_TX_FLAGS_DSCP_TOS_SHIFT 0
#define NRF_WIFI_TX_FLAGS_DSCP_TOS(x) \
	(((x) << NRF_WIFI_TX_FLAGS_DSCP_TOS_SHIFT) & \
	 NRF_WIFI_TX_FLAGS_DSCP_TOS_MASK)

enum nrf_wifi_tx_flags {
	NRF_WIFI_TX_FLAG_TWT_EMERGENCY_TX = (1 << 31),
	NRF_WIFI_TX_FLAG_CHKSUM_AVAILABLE = (1 << 30),
	NRF_WIFI_TX_FLAG_QOS_CTL_ACK_POLICY_NOACK = (1 << 29),
};

/**
 * @brief Tx mac80211 header information.
 *
 */
struct tx_mac_hdr_info {
	/** Unused */
	signed int umac_fill_flags;
	/** frame control */
	unsigned short fc;
	/** source Mac header */
	unsigned char dest[6];
	/** destination Mac address */
	unsigned char src[6];
	/** Ethernet type */
	unsigned short etype;
	/** Type of Service */
	unsigned int dscp_or_tos;
	/** TX flags */
	unsigned int tx_flags;
	/** more frames queued */
	unsigned char more_data;
	/** End Of Service Period flag(applicable in U-APSD) */
	unsigned char eosp;
} __NRF_WIFI_PKD;

/**
 * @brief This structure provides the information of each packet in the tx command.
 *
 */

struct nrf_wifi_tx_buff_info {
	/** Tx packet length */
	unsigned short pkt_length;
	/** Tx packet address */
	unsigned int ddr_ptr;
} __NRF_WIFI_PKD;

/**
 * @brief This structure provides the parameters for the tx command.
 *
 */
struct nrf_wifi_tx_buff {
	/** Command header @ref nrf_wifi_umac_head */
	struct nrf_wifi_umac_head umac_head;
	/** Interface id */
	unsigned char wdev_id;
	/** Descriptor id */
	unsigned char tx_desc_num;
	/** Common mac header for all packets in this command
	 *  @ref tx_mac_hdr_info
	 */
	struct tx_mac_hdr_info mac_hdr_info;
	/** HW checksum enable or disable bitmap */
	unsigned int csum_bitmap;
	/** Pending buffer size at host to encode queue size
	 *  in qos control field of mac header in TWT enable case
	 */
	unsigned int pending_buf_size;
	/** Number of packets sending in this command */
	unsigned char num_tx_pkts;
	/** Each packets information @ref nrf_wifi_tx_buff_info */
	struct nrf_wifi_tx_buff_info tx_buff_info[];
} __NRF_WIFI_PKD;

