nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
#define NRF_WIFI_TX_STATUS_SUCCESS 0
#define NRF_WIFI_TX_STATUS_FAILED 1

/**
 * @brief This structure represents the Tx done event(NRF_WIFI_CMD_TX_BUFF_DONE).
 *
 */
struct nrf_wifi_tx_buff_done {
	/** Header @ref nrf_wifi_umac_head */
	struct nrf_wifi_umac_head umac_head;
	/** Descriptor id */
	unsigned char tx_desc_num;
	/** Number of packets in this Tx done event */
	unsigned char num_tx_status_code;
	/** Frame sent time at Phy */
	unsigned char timestamp_t1[6];
	/** Frame ack received time at Phy */
	unsigned char timestamp_t4[6];
	/** Status of Tx packet. Maximum of MAX_TX_AGG_SIZE */
	unsigned char tx_status_code[0];
} __NRF_WIFI_PKD;

/**
 * @brief This structure defines the type of received packet.
 *
 */
enum nrf_wifi_rx_pkt_type {
	/** The Rx packet is of type data */
	NRF_WIFI_RX_PKT_DATA,
	/** RX packet is beacon or probe response */
	NRF_WIFI_RX_PKT_BCN_PRB_RSP,
	/** Raw Rx packet */
	NRF_WIFI_RAW_RX_PKT
};

/**
 * @brief This structure provides information about the parameters in the RX data event.
 *
 */
struct nrf_wifi_rx_buff_info {
	/** Descriptor id */
	unsigned short descriptor_id;
	/** Rx packet length */
	unsigned short rx_pkt_len;
	/** type PKT_TYPE_MPDU/PKT_TYPE_MSDU_WITH_MAC/PKT_TYPE_MSDU */
	unsigned char pkt_type;
	/** Frame received time at Phy */
	unsigned char timestamp_t2[6];
	/** Ack sent time at Phy */
	unsigned char timestamp_t3[6];
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents RX data event(NRF_WIFI_CMD_RX_BUFF).
 *
 */
struct nrf_wifi_rx_buff {
	/** Header @ref nrf_wifi_umac_head */
	struct nrf_wifi_umac_head umac_head;
	/** Rx packet type. see &enum nrf_wifi_rx_pkt_type */
	signed short rx_pkt_type;
	/** Refer rpu_tput_mode */
	unsigned char rate_flags;
	/** Rate: Legacy : 1, 2, 55, 6, 9, 11, 12, 18, 24, 36, 48, 54
	 *        11N VHT HE  : MCS index 0 to 7.
	 */
	unsigned char rate;
	/** Interface id */
	unsigned char wdev_id;
	/** Number of packets in this event */
	unsigned char rx_pkt_cnt;
	/** Depricated */
	unsigned char reserved;
	/** MAC header length. Same for all packets in this event */
	unsigned char mac_header_len;
	/** Frequency on which this packet received */
	unsigned short frequency;
	/** signal strength */
	signed short signal;
	/** Information of each packet. @ref nrf_wifi_rx_buff_info */
	struct nrf_wifi_rx_buff_info rx_buff_info[];
} __NRF_WIFI_PKD;

/**
 * @brief This structure provides information about the carrier (interface) state.
 *
 */
struct nrf_wifi_data_carrier_state {
	/** Header @ref nrf_wifi_umac_head */
	struct nrf_wifi_umac_head umac_head;
	/** Interface id */
	unsigned int wdev_id;

} __NRF_WIFI_PKD;

/** SoftAP client is in active mode */
#define NRF_WIFI_CLIENT_ACTIVE 0
/** SoftAP client is in power save mode */
#define NRF_WIFI_CLIENT_PS_MODE 1

/**
 * @brief This structure describes an event related to the power save state of the softap's client.
 *  When the client is in PS mode (NRF_WIFI_CLIENT_PS_MODE), the host should queue Tx packets.
 *  When the client is in wakeup mode (NRF_WIFI_CLIENT_ACTIVE), the host should send all
 *  buffered and upcoming Tx packets.
 *
 */
struct nrf_wifi_sap_client_pwrsave {
	/** Header @ref nrf_wifi_umac_head */
	struct nrf_wifi_umac_head umac_head;
	/** Interface id */
	unsigned int wdev_id;
	/** state NRF_WIFI_CLIENT_ACTIVE or NRF_WIFI_CLIENT_PS_MODE */
	unsigned char sta_ps_state;
	/** STA MAC Address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];

} __NRF_WIFI_PKD;

/**
 * @brief This structure represents an event that instructs the host to transmit a specific
 *  number of frames that host queued when softap's client is in power save mode.
 *  This event is primarily used when Softap's client operates in legacy power save mode.
 *  In this scenario, the access point (AP) is required to send a single packet for every PS POLL
 *  frame it receives from the client. Additionally, this mechanism will also be utilized in
 *  UAPSD power save.
 *
 */
struct nrf_wifi_sap_ps_get_frames {
	/** Header @ref nrf_wifi_umac_head */
	struct nrf_wifi_umac_head umac_head;
	/** Interface id */
	unsigned int wdev_id;
	/** STA MAC Address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** Number of frames to be transmitted in this service period */
	signed char num_frames;

} __NRF_WIFI_PKD;

/**
 * @brief Types of connection protected/un-protected.
 *
 */
enum nrf_wifi_conn_type {
	/* Connection to be non-protected */
	NRF_WIFI_CONN_TYPE_OPEN,
	/* Connection to be protected */
	NRF_WIFI_CONN_TYPE_SECURE,
};

/**
 * @brief This structure specifies the parameters to be used when sending an association request.
 *
 */
struct nrf_wifi_umac_assoc_info {
	/** Frequency of the selected channel in MHz */
	unsigned int center_frequency;
	/** ssid nrf_wifi_ssid */
	struct nrf_wifi_ssid ssid;
	/** MAC address (various uses) */
	unsigned char nrf_wifi_bssid[NRF_WIFI_ETH_ADDR_LEN];
	/**  WPA information element data. nrf_wifi_ie */
	struct nrf_wifi_ie wpa_ie;
	/** Whether management frame protection (IEEE 802.11w) is used for the association */
	unsigned char use_mfp;
	/** Indicating whether user space controls IEEE 802.1X port. If set, the RPU will
	 *  assume that the port is unauthorized until authorized by user space.
	 *  Otherwise, port is marked authorized by default in station mode.
	 */
	signed char control_port;
	/** Previous BSSID used in flag */
	unsigned int prev_bssid_flag;
	/** Previous BSSID used in Re-assoc. */
	unsigned char prev_bssid[NRF_WIFI_ETH_ADDR_LEN];
	/** Bss max idle timeout value in sec wich will be encapsulated into
	 *  BSS MAX IDLE IE in assoc request frame.
	 */
	unsigned short bss_max_idle_time;
	/** Connection type */
	unsigned char conn_type;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the command used to configure the signal quality
 *  threshold for generating events when the signal quality crosses the configured threshold.
 *
 */
struct nrf_wifi_cmd_sqi_threshold_config {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Interface index */
	unsigned int if_index;
	/** RSSI threshold */
	int rssi_thold;
	/** Hysteresis value */
	unsigned int rssi_hyst;
} __NRF_WIFI_PKD;

/**
 * @brief Signal Quality Level compared to the configured threshold.
 * enum nrf_wifi_sqi_event_level - signal quality level compared to the
 *                             configured threshold.
 */
enum nrf_wifi_sqi_event_level {
	/** Signal Quality Level is below the configured threshold */
	NRF_WIFI_EVENT_SQI_LEVEL_LOW,
	/** Signal Quality Level is above the configured threshold */
	NRF_WIFI_EVENT_SQI_LEVEL_HIGH,
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the event generated when the signal quality
 * crosses the configured threshold.
 *
 */
struct nrf_wifi_event_sqi_threshold_config {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Signal Quality Level see &enum nrf_wifi_sqi_event_level */
	signed int sqi_level;
	/** Last RSSI value */
	int last_rssi;
} __NRF_WIFI_PKD;

/**
 * @brief This structure represents the status code for a key command.
 *
 */
struct nrf_wifi_umac_event_key_cmd_status {
	/** Header nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Command status */
	int cmd_status;
} __NRF_WIFI_PKD;

/**
 * @}
 */

#define NRF_WIFI_CMD_MEAS_START_REQUESTED_VALID (1 << 0)
#define NRF_WIFI_CMD_MEAS_START_ASAP_VALID (1 << 1)
#define NRF_WIFI_CMD_MEAS_START_REQUEST_LCI_VALID (1 << 2)
#define NRF_WIFI_CMD_MEAS_START_REQUEST_CIVILOC_VALID (1 << 3)
/*
 * @brief This enum contains type of preamble to be used.
 */
enum nrf_wifi_preamble {
	/* legacy (HR/DSSS, OFDM, ERP PHY) preamble */
	NRF_WIFI_PREAMBLE_LEGACY,
	/* HT preamble */
	NRF_WIFI_PREAMBLE_HT,
	/* VHT preamble */
	NRF_WIFI_PREAMBLE_VHT,
	/* DMG preamble */
	NRF_WIFI_PREAMBLE_DMG,
	/* HE preamble */
	NRF_WIFI_PREAMBLE_HE,
} __NRF_WIFI_PKD;
