nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
/*
 * @brief This structure contains the information peer measurement params
 * to be used in peer measurement req structure.
 */
struct nrf_wifi_umac_meas_request {
	/** Peer MAC Address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/** band this channel belongs to */
	signed int band;
	/** center frequency in MHz */
	unsigned int center_frequency;
	/** Preamble to be used see &enum nrf_wifi_preamble */
	signed int preamble;
	/** Interval between the FTM bursts, typically 200ms */
	unsigned char burst_period;
	/** Number of ranging measurements to be performed within a single
	 *  burst transmission.
	 */
	unsigned char ftms_per_burst;
	/* FTM parameters, NRF_WIFI_CMD_MEAS_START_REQUESTED_VALID etc */
	unsigned char ftm_params;
	/** One burst measurement time */
	unsigned char burst_duration;
	/* Number of FTM bursts exchange in total: After negotiation to meas
	 * complete
	 */
	unsigned char num_bursts_exp;
	/* Minimum delta FTM */
	unsigned char min_delta_ftm;
	/* Tsf Timer value */
	unsigned short tsf_timer_value;
	/* Enable/disable Tsf Timer */
	unsigned char tsf_timer_disable;
} __NRF_WIFI_PKD;
#define MAX_NUM_PEERS  4
/*
 * @brief This structure contains the information to be passed to the RPU
 * to send peer measurement req using the NRF_WIFI_UMAC_CMD_MEAS_START command.
 */
struct nrf_wifi_umac_meas_req_info {
	/* measurement to be done with number of peers */
	unsigned int n_peers;
	/* timeout (in milliseconds) for the whole operation,
	 * if zero it means there's no timeout
	 */
	unsigned int timeout;
	/* Initiator MAC Address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/* Peer requests */
	struct nrf_wifi_umac_meas_request meas_req[MAX_NUM_PEERS];
} __NRF_WIFI_PKD;
/*
 * @brief This structure defines a command used to start FTM measurements
 * with peers using the NRF_WIFI_UMAC_CMD_MEAS_START command.
 */
struct nrf_wifi_umac_cmd_meas_start {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/** Identifier to be used for processing event */
	unsigned long long host_cookie;
	/* @ref nrf_wifi_umac_meas_req_info */
	struct nrf_wifi_umac_meas_req_info info;
} __NRF_WIFI_PKD;

/**
 * @brief This enum contains FTM measurement failure reasons.
 */
enum nrf_wifi_peer_meas_ftm_failure_reasons {
	/** Unspecified failure */
	NRF_WIFI_FTM_FAILURE_UNSPECIFIED,
	/** No response from peer */
	NRF_WIFI_FTM_FAILURE_NO_RESPONSE,
	/** Rejected by peer */
	NRF_WIFI_FTM_FAILURE_REJECTED,
	/** Wrong channel */
	NRF_WIFI_FTM_FAILURE_WRONG_CHANNEL,
	/** Peer not capable */
	NRF_WIFI_FTM_FAILURE_PEER_NOT_CAPABLE,
	/** Invalid timestamp */
	NRF_WIFI_FTM_FAILURE_INVALID_TIMESTAMP,
	/** Peer busy */
	NRF_WIFI_FTM_FAILURE_PEER_BUSY,
	/** Bad changed parameters */
	NRF_WIFI_FTM_FAILURE_BAD_CHANGED_PARAMS,
} __NRF_WIFI_PKD;

/**
 * @brief Bit indices used within the FTM event bitmap to indicate which
 * optional fields are present and valid in a given FTM result report.
 *
 * Each enumerator is a bit position (1 << index) in
 * @ref nrf_wifi_umac_ftm_result.valid_bitmap.
 */
enum NRF_WIFI_FTM_EVENT_BITMAP_INDEX {
	/** RTT value is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_RTT = 0,
	/** Distance (derived from RTT) value is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_DIST,
	/** RTT spread is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_RTT_SPREAD,
	/** RTT variance is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_RTT_VARIANCE,
	/** Aggregated RTT across multiple bursts is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_MULTI_BURST_RTT,
	/** Number of bursts in multi-burst measurement is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_MULTI_BURST_COUNT,
	/** Current burst index is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_BURST_INDEX,
	/** Total number of bursts expected is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_TOTAL_BURST,
	/** Successful FTM count in current burst is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_COUNT,
	/** Total FTM count across all bursts is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_TOTAL_COUNT,
	/** Generic measurement value field is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_VALUE,
	/** Non-ASAP delay value is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_NON_ASAP_DELAY,
	/** Burst period is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_BURST_PERIOD,
	/** Local interface MAC address is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_IF_MAC_ADDR,
	/** Peer MAC address is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_PEER_MAC_ADDR,
	/** FTM measurement timestamp is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_FTM_TIMESTAMP,
	/** LCI data is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_LCI_DATA,
	/** Civic location data is present */
	NRF_WIFI_FTM_EVENT_BITMAP_INDEX_CIVIC_DATA,
} __NRF_WIFI_PKD;

#define NRF_WIFI_EVENT_RESULT_RSSI_VALID (1 << 0)
#define NRF_WIFI_EVENT_RESULT_RSSI_SPREAD_VALID (1 << 1)
#define NRF_WIFI_EVENT_RESULT_RTT_VALID (1 << 2)
#define NRF_WIFI_EVENT_RESULT_RTT_VARIANCE_VALID (1 << 3)
#define NRF_WIFI_EVENT_RESULT_RTT_SPREAD_VALID (1 << 4)
#define NRF_WIFI_EVENT_RESULT_DISTANCE_VALID (1 << 5)
#define NRF_WIFI_EVENT_RESULT_DISTANCE_VARIANCE_VALID (1 << 6)
#define NRF_WIFI_EVENT_RESULT_DISTANCE_SPREAD_VALID (1 << 7)
/**
 * @brief This structure contains the peer measurement results information.
 */
struct nrf_wifi_umac_ftm_result {
	/* LCI data */
	unsigned char lci[100];
	/* civic location data */
	unsigned char civicloc[100];
	/* LCI data length */
	unsigned int lci_len;
	/* Civic location data length */
	unsigned int civicloc_len;
	/** FTM measurement failure reason see
	 * &enum nrf_wifi_peer_meas_ftm_failure_reasons
	 */
	signed int failure_reason;
	/* number of FTM bursts exchange */
	unsigned char num_bursts_exp;
	/* One burst measurement time */
	unsigned char burst_duration;
	/** Number of ranging measurements are
	 * performed within a single burst transmission
	 */
	unsigned char ftms_per_burst;
	/* average RSSI over FTM action frames reported */
	signed int rssi_avg;
	/* RSSI spread over FTM action frames reported */
	signed int rssi_spread;
	/** average of RTTs measured */
	signed long long rtt_avg;
	/** RTTs variance measured */
	signed long long rtt_variance;
	/** RTTs spread measured */
	signed long long rtt_spread;
	/** average of distance measured */
	signed long long dist_avg;
	/** distance variance measured */
	signed long long dist_variance;
	/** distance spread measured */
	signed long long dist_spread;
	/** Valid-field bitmap; bit index see @ref NRF_WIFI_FTM_EVENT_BITMAP_INDEX */
	unsigned int valid_bitmap;
} __NRF_WIFI_PKD;

