nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/common/fw_if/nrf71_wifi_ctrl.h
/*
 * enum nrf_wifi_meas_status - peer measurement status
 */
enum nrf_wifi_meas_status {
	/** Measurement successful */
	NRF_WIFI_FTM_STATUS_SUCCESS,
	/** Request failed */
	NRF_WIFI_FTM_STATUS_REQ_FAIL,
	/** No response from peer */
	NRF_WIFI_FTM_STATUS_NO_RESP_FROM_PEER,
	/** AP busy */
	NRF_WIFI_FTM_STATUS_AP_BUSY,
	/** FTM timeout */
	NRF_WIFI_FTM_STATUS_FTM_TIMEOUT,
};

/*
 * enum nrf_wifi_meas_type - peer measurement type
 */
enum nrf_wifi_meas_type {
	/** Invalid measurement type */
	NRF_WIFI_MEAS_TYPE_INVALID,
	/** FTM measurement type */
	NRF_WIFI_MEAS_TYPE_FTM,
};

/*
 * @brief This structure contains the information to be passed to the APP/Host
 * to send peer measurement results using the NRF_WIFI_UMAC_EVENT_MEAS_RESULTS
 * event.
 */
struct nrf_wifi_umac_meas_result_info {
	/** Measurement status see &enum nrf_wifi_meas_status */
	signed int status;
	/* MAC Address */
	unsigned char mac_addr[NRF_WIFI_ETH_ADDR_LEN];
	/* Measurement type see &enum nrf_wifi_meas_type*/
	signed int type;
	/* Measurement results received from peer */
	struct nrf_wifi_umac_ftm_result ftm;
} __NRF_WIFI_PKD;

#define NRF_WIFI_MAX_PMSR_PEERS 4
/*
 * @brief This structure defines a event used to send FTM measurements results
 * with peers using the NRF_WIFI_UMAC_EVENT_PEER_MEAS_RESULTS.
 */
struct nrf_wifi_umac_event_peer_meas_results {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* Cookie id */
	unsigned int cookie_id;
	/* number of peers  */
	unsigned int num_peers;
	/* @ref nrf_wifi_umac_meas_result_info */
	struct nrf_wifi_umac_meas_result_info peers[MAX_NUM_PEERS];
} __NRF_WIFI_PKD;
#define NRF_WIFI_EVENT_GET_LCI_VALID (1 << 0)
#define NRF_WIFI_EVENT_GET_CIVIC_VALID (1 << 1)
/*
 * @brief This structure defines a event used to get the FTM LCI & Civic
 * Location info using the NRF_WIFI_UMAC_EVENT_GET_LCI_CIVIC_INFO.
 */
struct nrf_wifi_umac_event_get_lci_civic_info {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* Get LCI & Civil location info ex: NRF_WIFI_EVENT_GET_LCI_VALID  */
	unsigned char lci_civic_flag;
} __NRF_WIFI_PKD;
/*
 * @brief This structure contains the LCI & Civic location information to send
 * peer device.
 */
struct nrf_wifi_umac_lci_civic_info {
	/* LCI data length */
	unsigned int lci_len;
	/* Civic location data length */
	unsigned int civicloc_len;
	/* LCI data */
	unsigned char lci[100];
	/* civic location data */
	unsigned char civicloc[100];
} __NRF_WIFI_PKD;
/*
 * @brief This structure defines a command used to send FTM LCI & Civic info
 * to peers using the NRF_WIFI_UMAC_CMD_LCI_CIVIC_INFO command.
 */
struct nrf_wifi_umac_cmd_lci_civic_info {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* @ref nrf_wifi_umac_lci_civic_info */
	struct nrf_wifi_umac_lci_civic_info info;
} __NRF_WIFI_PKD;

/*
 * @brief This structure contains the ftm parameters configuration information.
 */
struct nrf_wifi_umac_ftm_responder_config_info {
	/** FTM responder runtime mode, Enable = 1, Disable=0 */
	unsigned char ftm_responder_enable;
	/** Power save, Enabled=1, Disabled=0  */
	unsigned char power_save;
	/* Channel information.@ref nrf_wifi_chan_definition, valid in non-connected mode */
	struct nrf_wifi_chan_definition chan_def;
} __NRF_WIFI_PKD;

/*
 * @brief This structure defines a command used to configure ftm responder.
 */
struct nrf_wifi_cmd_ftm_responder_config {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* @ref nrf_wifi_umac_ftm_config_info */
	struct nrf_wifi_umac_ftm_responder_config_info info;
} __NRF_WIFI_PKD;

struct nrf_wifi_gas_query_config_info {
	/** Mac address of AP */
	unsigned char bssid[6];
	/** dialog_token of gas query frame */
	unsigned char dialog_token;
	/** Channel in which req need to sent */
	unsigned int channel_num;
	/** band in which channel belongs to */
	signed int band;
	/** protocol ie */
	unsigned char protocol_ie[4];
	/** length of frame */
	unsigned char length;
	/** query_ids info */
	unsigned char query_ids[0];
} __NRF_WIFI_PKD;

struct nrf_wifi_cmd_gas_anqp_config {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* @ref nrf_wifi_gas_query_config_info*/
	struct nrf_wifi_gas_query_config_info info;
} __NRF_WIFI_PKD;


struct nrf_wifi_gas_anqp_info {
	/** dialog_token of gas comeback resp frame */
	unsigned char dialog_token;
	/** status success or fail */
	unsigned short status;
	/** delay requested from AP */
	unsigned short comeback_delay;
	/** protocol used */
	unsigned char protocol_ie[4];
	/** length of the query in response */
	unsigned char query_resp_len;
	/** query data in response */
	unsigned char resp_data[0];
} __NRF_WIFI_PKD;

struct nrf_wifi_umac_event_get_gas_anqp_resp {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* Get gas comeback response info */
	struct nrf_wifi_gas_anqp_info info;
} __NRF_WIFI_PKD;

struct sub_elememts {
	/** Mode used in request */
	unsigned char req_mode;
	/** Token used in request */
	unsigned char req_token;
	/** Subject used in request */
	unsigned char req_sub;
} __NRF_WIFI_PKD;

#define LCI_REQ    1
#define CIVIC_REQ  2

struct nrf_wifi_neighbor_req_config_info {
	/** dialog_token of neighbor req frame */
	unsigned char dialog_token;
	/** sub elements enabled in neighbor req frame */
	unsigned char sub_elems;
	/** LCI sub elements */
	struct sub_elememts lci;
	/** CIVIC sub elements */
	struct sub_elememts civic;
	/** civic location type */
	unsigned char civic_loc_type;
	/** civic interval units used */
	unsigned char civic_interval_units;
	/** civic interval value */
	unsigned short civic_interval;
} __NRF_WIFI_PKD;


struct nrf_wifi_cmd_neighbor_req_config {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* @ref nrf_wifi_neighbor_req_config_info*/
	struct nrf_wifi_neighbor_req_config_info info;
} __NRF_WIFI_PKD;

struct nrf_wifi_neighbor_report_info {
	/** dialog_token of neighbor resp frame */
	unsigned char dialog_token;
	/** length of neighbor resp frame */
	unsigned short len;
	/** Neighbor response data */
	unsigned char resp_data[0];

} __NRF_WIFI_PKD;

struct nrf_wifi_event_neighbor_report_result {
	/* Header @ref nrf_wifi_umac_hdr */
	struct nrf_wifi_umac_hdr umac_hdr;
	/* @ref nrf_wifi_neighbor_report_info */
	struct nrf_wifi_neighbor_report_info info;
} __NRF_WIFI_PKD;

#endif /* __NRF71_WIFI_CTRL_H */
